["Commit this method to memory for caramelized and crisp yet tender vegetables all year long. The kindest thing you can do for yourself when you’re stiff from being in the cold is to find some warmth: Because as the chill in your bones starts to fade, so does your stiffness. The same thing happens to hard winter vegetables when they’re enveloped in the heat of the oven — they soften and sweeten as they roast until they’re golden outside and tender in the middle.", "Kenji López-Alt’s buttery, unabashedly garlicky noodles are as easy to make as they are to devour. Good morning. The vernal equinox is in less than three weeks, but you wouldn’t know it from the frosted mud in the woods and the storm-wounded lawns where I stay. It’s bare ugly everywhere save in the bays, where water clear as gin flows over rocks in a spectrum of pink. At the market: cabbage and potatoes, a box of turnips, industrial berries that might have been grown in space. The new season’s coming, sure as tulips, but right now it’s hard to imagine.", "Just add rice or potatoes (and maybe a chilled white wine). Citrus and salmon is a winning combination, previously proven in New York Times Cooking’s recipes for broiled salmon with mustard and lemon, roasted salmon with ginger-lime butter and citrusy roasted salmon and potatoes. Our newest addition to this esteemed company is Farideh Sadeghin’s recipe for orange-glazed baked salmon. It’s a no-fuss fish dinner with a clever, timesaving twist: Farideh builds a side salad into the recipe by tossing salad greens with some of the reserved honeyed orange juice that is used to flavor the salmon. If you’re looking at the above image and thinking, “I bet blood oranges would be especially beautiful and excellent in this recipe,” know that Coco, a reader, already tried that and can confirm that the results were “absolutely delicious.”", "It’s a showstopping kaleidoscope of bulgogi, shiitakes, bean sprouts, spinach, carrots and cucumbers, all drizzled with a spicy gochujang sauce. Good morning. On Sunday, I like a project in the kitchen more than on any other day. It’s a chance to work at the stove without the need to get something on the table in 45 minutes, a time to stretch my skill set. Mostly, it’s an opportunity to explore recipes rather than simply following them. On Sundays I don’t want to fly by wire. I want to fly.", "In the third installment of her YouTube series, the cookbook author and chef Sohla El-Waylly will teach you how to master the basics of the bird. For beginners and experienced cooks alike, preparing chicken can come with a lot of questions (and nerves!). Am I going to get salmonella? How do I butcher a whole bird? Am I doomed to an eternity of dry breast meat? In the third installment of her YouTube series, Cooking 101, the chef and cookbook author Sohla El-Waylly will help you master the basics of the bird, then set you up with a handful of recipes that highlight white and dark meat.", "Leave it to Ali Slagle to bring brightness and ease to these (hopefully) last deep winter dinners. Congratulations! You’ve made it through February, the shortest — and longest — month of the year. We all get extra credit too, because it’s a leap year. But next time I’d like a leap day in June, please.", "Sip teas inspired by Frank Lloyd Wright, learn to cook the cuisine of Punjab and more food news. Some cutting-edge appliances like the air fryer may have risen in popularity lately, but the simple sheet pan has become as essential as a cast-iron skillet. In the past, the sheet pan was often called a rimmed baking sheet and used in kitchens to make the cake known as chocolate roulade; it’s now all you need for a meal. New York Times Cooking lists nearly 1,000 sheet-pan recipes, many of them dinners. As Olga Massov and Sanaë Lemoine demonstrate in their new, cheekily titled cookbook, “Hot Sheet,” you can make just about anything but soup on a sheet pan. They take you through breakfast, lunch, dinner and dessert using mainly half-sheets (18 by 13 inches) but also quarter sheets. They discuss materials but, oddly, never mention the issue of warping, which cheaper unreinforced pans are prone to do. The all-in-one recipes like fish over cabbage; chicken with olives, dates and preserved lemon; and also sheet-pan fried rice; roasted carrots; and granola, are the best. Though you can use a sheet pan to roast a whole chicken, duck or rack of lamb, other implements could do the job as well or better, especially when a recipe requires two sheet pans, which seems to miss the point. As for a clafoutis, a pie plate works just fine. Photos of well-used pans with their smudges of dark residue might resonate with home cooks.", "Higher prices? Fewer places? As several states consider lifting wages for tipped workers, here’s how the shift is already playing out in the nation’s capital. The last few years have fundamentally changed Americans’ relationship with restaurants. As the pandemic made diners more aware of the long hours and low pay built into the business, many began tipping more, donating to employee funds and lobbying elected officials for worker protections.", "This internet-famous spaghetti with cherry tomatoes and kale lets you cook noodles and sauce in the same pot. Last week, I asked for your favorite brilliant and easy dinners after I shared a new one of mine, Eric Kim’s peanut butter noodles. I got an email from a reader named Lia that was so attuned to the prompt that I’m sharing it here. It’s a no-recipe recipe for roasted salmon, and to me it both reads like a scene from my own kitchen (“check emails quickly if it’s not done yet”) and sounds like it should be dinner tonight:", "Two restaurants, Marc179 and the Chef’s Counter at Greywind, are open only three days a month. You’ll be able to dine at this pair of new restaurants about as often as you receive your electric bill. Marc Murphy, who is opening Marc179, his first restaurant since 2019, will serve dinners three nights each month in the TriBeCa building that had housed Landmarc and which he uses for private events, TV and photo shoots. “Smaller works for me,” Mr. Murphy said. “I’ve missed interacting with the public and this allows me to be there.” He has redone the space with skylights and seating for 64, and will serve a four-course menu, $75. It will change monthly; the lineup for March is arugula salad, bucatini cacio e pepe, roast chicken breast with mushrooms, and chocolate mousse. A brief wine list of half and whole bottles is gently priced with a bottle of Domaine Drouhin-Vaudon Chablis for $38, a bottle of Mas de Daumas Gassac cabernet sauvignon for $65, a half-bottle of Ridge Lytton Springs zinfandel for $42, and a half-bottle of Krug Grand Cuvée for $110. “I’ve gone from six restaurants and 650 employees to just four, and I can make money here,” Mr. Murphy said. When not serving dinners, the space houses his events company, MM Kitchen Studio. (Opens March 7, 8, 9) Then there’s Dan Kluger with Greywind, a complex near Hudson Yards that has a restaurant, a bar called Spygold and a bakery that becomes the Chef’s Counter three evenings a month. “I need to be there, but I don’t want to take on too much,” Mr. Kluger said. “The space is also used for private events so I can’t overcommit.” The counter has seats for eight people and offers about six courses with various themes, changing each month, with vegetables and proteins in tandem, $185 at 5:45 and 8:15 p.m. Last week’s menu included leek terrine with potato soup and trout roe, and chicken “oyster” with oyster mushrooms. (March 20, 21, 22)", "“This meal was simple, healthy, and so incredibly tasty. I’d eat this every night of my life,” a reader says of my sheet-pan chicken with garlic yogurt. We’ve had a few glorious days of faux spring here in New York City, a balmy omen of sunshine to come. Only a few short weeks of winter to go!", "Adas polo, a Persian recipe perfumed with cinnamon and layered with caramelized onions and dates, only feels expensive. A bowl of lentils and rice is essential comfort food across so many cultures, be it South Asian khichdi, Middle Eastern mujadara or Greek fakorizo. No matter how traditional recipes differ, combining lentils and rice always results in a dish that’s thrifty, hearty and infinitely adaptable, inspiring as many appealing variations as there are inventive cooks.", "Ali Slagle’s new carbonara-leaning skillet pasta with bacon and eggs is a quick and easy meal for any time of day. When I’m tired and hungry and there’s nothing promising in the fridge save for a half-dozen eggs, there’s always breakfast for dinner. Scrambled eggs on toast or a crisper-clearing frittata are dependable, self-assuring standbys. And if I also have a couple of strips of bacon, a generous scoop of orzo and a bit of Parmesan, there’s skillet pasta with bacon and eggs, a brilliant new recipe from Ali Slagle. It’s quick, easy and a little luxe — the runny egg yolks mingle with the bacony, cheesy pasta to create a carbonara-leaning one-pot meal. Eat this for Friday dinner with a handful of arugula on the side (for “health”), or for Sunday breakfast with sliced oranges and never-ending coffee.", "Dates add their rich, molasses-y flavor to roasted fennel and farro salad, blackened broccoli and a pantry friendly Persian lentil rice. On a recent night in the East Village of Manhattan, the Avenue A sidewalk brimmed with chattering bargoers as Tupac’s “California Love” blared from an indeterminable source. A marquee loomed above, and through a veil of vape and cigarette exhaust, its two words beckoned: “DATE SHAKE.”", "The modern version of jocón incorporates Maya techniques and ingredients, as well as Spanish components. Seven years ago, just as Jorge Cárdenas was about to open Ix Restaurant in Prospect Lefferts Gardens, Brooklyn, he returned to his home in Quetzaltenango, in the highlands of Guatemala, to make sure that his recipes tasted like those his Maya grandmother had taught him to make.", "Take a tiny vacation in the middle of your day. Back in 2016, shortly after I joined the magazine Bon Appétit as an assistant editor, two of the top editors treated me to lunch. They decided on Augustine, the short-lived, four-dollar-sign Keith McNally restaurant on the ground floor of the Beekman hotel in the financial district.", "What to cook this weekend: chicken with couscous, dates and buttered almonds; easy roast duck; and a heavy pot of Boston baked beans. Good morning. I’m going hard on the fats and proteins this weekend. That’s not only because it’s still winter, but also because, for many, next week brings the start of Ramadan and its daily fasts that start at dawn and end with iftar, the sunset meal to break the fast.", "This brown bread recipe, a staple of the Ballymaloe Cookery School in Cork, Ireland, is as satisfying and foolproof as they come. The first time I had brown bread from Ballymaloe Cookery School in Cork, Ireland, was at a welcome lunch for students.", "With his unique blend of Lowcountry and Caribbean influences, he ranked among the best of a new generation of Black culinary wizards. Max Hardy, who helped bring a new level of chef-driven yet accessible cuisine to his native Detroit, and who was widely considered among the most promising of a young generation of Black culinary stars, died on Monday. He was 40.", "Hetty Lui McKinnon’s satisfying take on leeks vinaigrette combines silky leeks with a mustardy miso dressing and creamy white beans. I respect leeks. They stand firm and tall above their allium kin, their jade-green tops proudly poking out from your grocery bag. They make you work for them, with all that careful washing to rinse the sand and grit from between their layers. (They’re also, as far as I know, the only vegetable to be constantly carried by a Pokémon.) And leeks are thoughtful — they don’t make you cry as you chop them for your meal. (I’m looking at you, onions.)", "This stolid supporting player has slowly risen to a starring role in creative restaurants across the country. Some diners, though, may need a little coaxing. If I were a vegetable, I would hire cabbage’s brand manager.", "Just as your leeks need miso, and as your barley soup could use some kielbasa. Good morning. I’m embracing nostalgia today, luxuriating in memories of a Brooklyn I never experienced, even though I’m borough-raised. Imagine egg creams at the soda fountain, a long trip on the rattan seats of an old-timey subway car, then the mechanical horse races at Coney Island and a visit to Ebinger’s afterward, for blackout cake. See me in my peaky newsboy hat!", "Fed up with no-shows and last-minute cancellations, restaurants are increasingly charging fees as high as $100 a head. And some diners are pushing back. To celebrate his wife’s birthday in 2022, Brian Azara, a mechanical engineer in New York City, booked a table for two at a Michelin-starred restaurant in Brooklyn. But when their son was suddenly hospitalized with severe asthma, Mr. Azara had to cancel the reservation. A few minutes later, he checked his credit card account and saw a $200 fee.", "Once the pre-eminent food court in Flushing, Queens, for a variety of regional Chinese cuisines, this mall has reopened after a four-year renovation. And a new Golden Mall in Manhattan is on the horizon. When the Golden Mall opened in Flushing, Queens, in 1990, its patrons didn’t mind getting lost within the maze of vendors in order to find chile oil-slicked noodles, chunky sea bass dumplings or cumin-scented lamb burgers.", "More weeknight dishes that wow: herby pork larb, sticky chicken with brussels sprouts and shrimp in purgatory. I became a regular at Sofreh the minute Nasim Alikhani first flung open the doors to the chic Persian restaurant in Prospect Heights, Brooklyn. I was irresistibly pulled in by her fragrant platters of duck fesenjan and fish with herbs and tamarind. No matter my order, though, I had to include adas polo ba khorma — Medjool date and lentil rice. A cinnamon-scented mound of soft basmati rice, lentils and dates sprinkled with saffron and rose water and garnished with crisp slivers of fried onion, it was the dish that most haunted me between visits.", "Why fry when you can freeze? About 1,500 years ago, in the mountains of northern China, you might have found bamboo mats lined with slabs of tofu, resting in the snow overnight. Once frozen solid, “the structure and basic character of the tofu underwent a radical transformation,” William Shurtleff and Akiko Aoyagi wrote in “The Book of Tofu” (1975).", "The city’s Department of Transportation issued new rules for Dining Out NYC, its official program, and more food news. Like them or not, the outdoor dining sheds that have been an upshot of the pandemic are more or less here to stay. Last week, City Hall and the Department of Transportation issued new guidelines for Dining Out NYC, its official program, and the largest such program in the country. “It’s been a priority for Mayor Adams from Day 1,” said Ya-Ting Liu, the city’s chief public realm officer. Restaurants and other establishments that serve food can now apply for permits to take part through an official portal online. Those that are approved and pay a fee for a four-year license ($1,050) for either a roadbed or sidewalk enclosure have 30 days to remove their temporary structures or outfit them to comply with the city’s rules. The authorized structures can remain in place from April through Nov. 29. Restaurants without approval will have to remove their sheds by Aug. 3; those with a pending application will have until Nov. 1. The city has approved four prototypes designed by WXY Studio to eliminate many of the problems with existing makeshift sheds and to adapt to various roadway and sidewalk configurations. They are being built by SITU, a fabrication company, and are already in place at several restaurants. They are not heated and will supposedly be rat-proof; some models are equipped with solar panels. At Bodrum, on Amsterdam Avenue on the Upper West Side, Huseyin Ozer, an owner, said the 40-foot unit in the roadway outside his restaurant had planters, could be customized with signage, will allow for 16 seats and is easy to disassemble. Hinged floor panels lift to allow for cleaning. Full compliance citywide is expected when the season reopens in April 2025.", "Ginger-dill salmon, skillet chicken with orzo, dill and feta and (frozen) fava bean stew are herbaceously springy. Spring is so close I can taste it — or at least I’m trying to taste it, as I load up my grocery list with green things like arugula, scallions and leafy herbs. We’re still weeks away from peak spring produce, but you can hustle winter out the door if you lean heavily on ingredients that are available in March but are giving May.", "Siete serves up vegan Mexican dishes, Tucci brings contemporary Italian into the Delmonico’s portfolio and more restaurant news. With this new venture, the married chefs Angie Rito and Scott Tacinelli, and their partner Michael Stillman’s Quality Branded, aren’t fretting about driving business from their high-profile Italian American restaurant, Don Angie, which opened six years ago just a few doors south. “It’s different, there’s more seafood and we’re being creative with it,” Mr. Tacinelli said. The restaurant’s name is that of the patron saint of Sanza, Mr. Tacinelli’s grandfather’s native village in Campania, Italy. (He was also named Sabino.) The menu, a collaboration by the chefs, has seafood front and center, with scallop crudo, crab and mortadella dip, insalata Louie with dressed shrimp, farfalle stuffed with smoked chili crab, grilled coho salmon, and shrimp Parm with sweet and sour arrabbiata. Cured meats play an important supporting role in several dishes, as spicy capocollo dresses octopus carpaccio and ’nduja seasons stuffed mussels. As at Don Angie, the pastas are all made in-house. The room, lit with slashes of bright gold is seemingly expansive thanks to a mirrored wall. It seats 45 at mahogany tables, some set at toffee-colored leather banquettes. Another 10 seats are at a bar with more curves than the Amalfi Drive.", "Rick Martinez’s streamlined recipe updates a 1980s favorite for 2024 weeknights. My parents’ initiation into elevated home cooking came by way of Julia Child’s soufflés and coq au vin, but for me the gateway was phyllo triangles and carrot cake from “The Silver Palate Cookbook.” That milestone book, by Julee Rosso and Sheila Lukins, made cooking seem easy, playful and fun, with a lighthearted tone and recipes that captured the fresh and casually stylish zeitgeist of the early 1980s. For better or worse, it introduced an entire generation to arugula, raspberry vinegar and homemade walnut-basil pesto (that last one whirled in a blender).", "This forgiving and adaptable weeknight dinner stars tender chicken thighs, braising greens and whole garlic cloves. If the overabundance of root vegetables like sunchokes, black radishes and kohlrabies the size of my head is the late-winter scourge of my C.S.A., the steady supply of braising greens is its redemption. No matter how many bunches of curly kale, sturdy collard greens and steely chard arrive each week, there’s always a place on my table for their floppy, verdant magic.", "In the second installment of Ask Kenji, the cookbook author Kenji López-Alt tackles tough questions about tender meat. In this column, Ask Kenji, the cookbook author Kenji López-Alt answers your questions. This week, he tackles tough questions about yielding tender meat.", "A new recipe from Hetty Lui McKinnon combines salty halloumi cheese, jarred marinara and harissa for a fantastically easy five-ingredient baked pasta. I found halloumi later in life, and we connected instantly. It’s salty, tangy and squeaky, an underrated quality in cheese. So I’m making up for lost halloumi time with pesto pasta with halloumi, seared halloumi salads and this new five-ingredient baked tomato pasta with harissa and halloumi from the vegetarian cooking queen Hetty Lui McKinnon.", "A short stay in the freezer removes just enough moisture to create an impressively crisp exterior and pleasantly spongy interior when roasted. To open my freezer door is to ask for trouble. If you’re lucky, you’ll be able to catch the bag of frozen dumplings or compost scraps as it tumbles from the precarious perch atop a lumpy bag of ice. If you’re not so lucky, the batch of 50/50 martinis you made for the party will launch itself from the frozen cannon I’ve inadvertently created and detonate on the tiled floor, as my friend Gabe learned a couple of months back.", "They’re here today, gone tomorrow. Here are three worth tracking down. Restaurant pop-ups, by their very nature, are ephemeral and hard to pin down. But they can also be destinations for some of New York’s most creative and inspired dining as the chefs that run them aren’t bogged down by the minutiae that plague brick-and-mortar restaurants. Sometimes, pop-ups become popular, permanent restaurants, as in the cases of Saigon Social or L’Appartement 4F or Dame. But most of the time, they appear and disappear and reappear like so many cicadas. (Speaking of, did you know we’re expecting a once-in-a-lifetime double brood this spring?)", "That way the flavors have time to deepen in the fridge, with plenty of celery root, carrots and parsnips, and lemon juice to make it pop. Good morning. How are you doing? This week marks four years since many of us went into lockdown after the World Health Organization declared the coronavirus to be a pandemic. Amid the fear and illness there would turn out to be, for some, scant pleasures: fragrant, crusty sourdough boules, long walks on quiet streets, seeking beauty amid the darkness. But for many there was simply dread, dread unending, and only pantry meals to mark the passage of time.", "We’re looking for shoppers to document their habits for a story that will paint a portrait of food purchasing in America today. What someone buys at the grocery store can say a lot about who they are. Who hasn’t peeked into the cart of the person in front of you at checkout and tried to piece together their life?", "Raoul’s, which he founded, was a celebrity magnet and a neighborhood institution in the 1970s and ’80s. But he had never planned on a life in the restaurant business. Serge Raoul, an Alsatian-born former filmmaker who with his brother, Guy, a classically trained chef, founded Raoul’s, a clubby French bistro and SoHo canteen in Lower Manhattan that drew generations of artists, rock stars, writers, models, machers and movie people — along with those who yearned to be near them — died on March 8 at his home in Nyack, N.Y. He was 86.", "Four words, a lot of weekend baking delight. I always get a kick from cooking with booze. “Shots!” I’ll announce to nobody in particular as I add the tequila for salted margarita bars. And, without fail, “one for you, one for me” as I deglaze my skillet with a glass of white wine.", "Boneless beef chuck burbles with maple syrup, caramelized tomato paste, thyme, soy sauce and bay leaves in Vallery Lomas’s bourbon-braised beef. Good morning. Happy St. Patrick’s Day to all those who celebrate. I like corned beef and cabbage myself for the holiday — Irish American food to ship up to Boston with, soda bread on the side.", "Her Manka’s Inverness Lodge drew actors and writers who dined at Ms. Grade’s farm-to-table restaurant and reveled in her eccentric flair. Margaret Grade, a California neuropsychologist who made a sharp career turn to open a cozy, eclectic inn near the Point Reyes National Seashore that was known for tending to farmers and fishers with the same attentiveness it gave to the film stars and writers who sought sanctuary there, died on Feb. 28 in San Francisco. She was 72.", "In London, “competitive socializing” transforms pubs into stock exchanges, golf courses and cricket fields for those looking for more elaborate drinking games. “Buy, buy, buy,” a bargoer shouted just after 6:30 on a recent Wednesday evening. He grabbed two shot glasses, vodka sluicing over his hands.", "The best way to start making homemade sweets? Follow these basic instructions and tips. The poet Emily Dickinson was an avid baker, and, on the back of a recipe card for coconut cake, she wrote these opening lines:", "My garlicky chicken with lemon-anchovy sauce is a well-loved weeknight classic. If there’s ever a “secret” ingredient to my cooking, it’s probably anchovies. Tossing a few genial fillets into just about anything (salad dressings, eggs, pastas, beans, stews) imbues a salty, funky earthiness that’s not the least bit fishy. Anchovies contribute so much verve for so little effort and expense, and they are — along with garlic and lemon — a key seasoning in much of my weeknight cooking.", "Peruse vintage home goods from Provence, pick up chocolate-dipped matzo and more food news. The latest hefty volume quarried by the team at Modernist Cuisine, the research kitchen, photography studio and cookbook publisher founded by Nathan Myhrvold, is “Modernist Bread at Home.” It’s a follow-up for nonprofessionals to “Modernist Bread,” published seven years ago. Lavishly photographed with step-by-step instructions for hundreds of breadstuffs, it includes scientific and practical techniques, details about ingredients and even a dozen patterns for scoring a loaf. Recipes are geared to the home cook. As a companion to the 420-page book and a 172-page recipe manual, there is also a series of free monthly email courses. They will be available through August; it is not necessary to own the book, though it will be referenced throughout the courses. “Getting Started With Bread Basics” is running this month, and “Navigating Bread Making From Start to Finish” will be covered in April. Those who enroll will receive one lesson per day in their inbox, for five to seven sessions, as well as a recap.", "A Missouri high school program teaches students to take freshly killed animals from the field to the classroom and into the kitchen. At Maysville High School in Maysville, Mo., population 1,100, classes can be a little tough for the squeamish. Course work can involve assigned reading and algebra, but also a serious amount of blood and guts.", "Something about the crackle of the crust, the snap of the bubbles and the salt and spice of the chicken makes for an extraordinary combination. Which came first, the fried chicken or the Champagne?", "Bright, breezy recipes to welcome spring. I am not one for spring cleaning, but I am one for spring cooking, throwing open the windows and airing out those stewy winter cooking habits. Whether I’m loading a skillet with everything green (like this herb-laden chicken dinner) or cranking up the grill on the first 60-degree day (hello, flank steak), I’m breezily banishing all thoughts of winter. Even the crispy coconut shrimp dish below is shouting “spring break!” ", "The chef Vikas Khanna serves a menu that covers Kashmir south to Kerala. The chef and cookbook author Vikas Khanna, whose New York debut many years ago was at the Michelin-starred Junoon, now has a place to call his own here. He and his business partner, Jimmy Rizvi, who owns GupShup and other restaurants, settled on the East Village. “The space is so unassuming but unforgettable when you walk in,” Mr. Khanna said. He could not resist the flight of steps going down from the street level, which reminded him of the entrance to the famous Golden Temple in Amritsar in his native Punjab in the north of India. “It makes the entrance surprisingly majestic,” he said. Then why call it Bungalow? In the India of the Raj, bungalows were aristocratic dwellings. First there is a bar area with tables, then a semi-open kitchen and beyond that a spacious dining room, the rear portion of which has greenery and a skylight. The menu trawls Indian cooking from Kashmir south to Kerala, with dahi puri stuffed with lentils from Varanasi, a Kashmiri dish made with lotus roots, a tart Jewish-Indian chicken curry Chitranee, malai chicken with cheese, Muslim saffron bread called sheermal, Rajasthani pulled lamb, and spicy shrimp balchão, which has Portuguese roots. Classics like chicken biryani are also on the menu. Mr. Khanna, who lives in New York, plans to spend most of his time on the premises. “It’s my dream,” he said.", "Ham El-Waylly’s fast, easy recipe has the creamy texture of an Alfredo and a bright, herbal tang that’s perfect for spring. Hello from the road! I’m scouting for part of our annual national restaurant list, eating nonstop at a slew of new-to-me places. As inspiring and fun as this is — and wow is it ever — it can also be a little overwhelming. Trips like these make me miss the simple meals I cook in my own kitchen.", "This traditional dish, heady with spices and deeply satisfying, serves as a reminder of survival and possibility. There’s something distinctly satisfying about messy food: sauce dripping down the side of your mouth, juices drizzling across your fingers. It’s the experience you might have when eating a taco or a burger. And it’s most definitely the experience of eating doubles.", "A fragrant mash-up of shakshuka, eggs in purgatory and egg curry, this easy one-pan recipe can be made with pantry ingredients you probably already have on hand. Poaching eggs in a simmering tomato sauce is a classic path to a quick, meatless meal. Be it an oniony shakshuka or chile-flecked eggs in purgatory, the mix of tangy-sweet tomatoes swirled with runny egg yolk is a perennial crowd-pleaser, as welcome on the table for a steamy Easter brunch as it is for a cozy dinner on any chilly evening.", "For Ecuadoreans, fanesca, a labor-intensive soup served just during the lead-up to Easter, is a staple of Holy Week festivities. More than 40 years ago, a statue of the Virgin of El Quinche was brought to the United States by a family from Ecuador. To celebrate its arrival at the now-shuttered St. Ann’s Church in Lower Manhattan, Rosa Cartagena and a team of women started a new tradition at the church: making and selling fanesca, a soup so labor-intensive that it is served for only a limited time during the Lenten season.", "The century-old club, in Helena, had a celebrated Black bartender and a membership of Montana’s biggest movers and shakers. The Montana Club, a celebrated bar, dining room and gathering place in Helena that was founded by frontier movers and shakers in 1885 — four years before Montana became a state — will close its doors after one final toast on March 29.", "Recipes for when you want fancy-Friday vibes but have meh-Monday energy. Granted, I was born and raised in California, but I will always consider the roast chicken from Zuni Café, in San Francisco, to be the platonic ideal of a Fancy Chicken Dinner. So my Zuni senses were tingling when I saw Melissa Clark’s new recipe for herby skillet chicken with greens. It hits all the necessary notes: crisp skin, tender meat, sturdy greens and scallions dressed in garlicky chicken drippings made just puckery enough with something acidic (in this case, lemon).", "Sweet potatoes with tahini butter, coconut saag and broccoli aligot are delicious at any age. This is Tejal, filling in for Tanya — hello! I’ve missed you! I just got back from parental leave, which means that I’m now strategizing and scheming about what I’m going to eat each day with a sweet, sticky, roly-poly 6-month-old baby.", "Are they more “Better Call Saul” or “How I Met Your Father”? When I was in second grade, my elementary school principal convinced my parents that children should not watch TV on weekdays. Naturally, I developed a crippling, lifelong obsession with television.", "This classic Jamaican treat is bold, bright and vibrant, and central to the holiday. For many Jamaicans, spice bun is a staple of Lent, the 40-day period before Easter marked by prayer, penitence and restraint, for those observing. But there’s nothing restrictive about this baked good, so named for its bold seasonings.", "For the illustrator Paul Karasik, an Italian salesman’s ingenuity led to a surprising discovery. Follow New York Times Cooking on Instagram, Facebook, YouTube, TikTok and Pinterest. Get regular updates from New York Times Cooking, with recipe suggestions, cooking tips and shopping advice.", "Satisfying dishes that invite improvisation. Good morning. Perloo (above) is a dish you’ll find all over the Lowcountry of South Carolina, a tomato-stained one-pot rice stew with roots in West Africa.", "Recipes for those gray, not-so-springy days: skillet eggs with garam masala and tomatoes, braised chicken with salted lemon, sweet potato shepherd’s pie. I started buying eggs by the 30-pack in quarantine and never stopped. If there’s eggs in the fridge, I can put dinner on the table: baked eggs, eggs kejriwal, kimchi eggs, romesco eggs. (For context, there’s only two of us in this household. We just really love eggs.)", "Make these all-purpose biscuits today and they’ll be terrific. Make them three weekends in a row and they’ll be the best biscuits ever. Good morning. If you make biscuits (above) today — and you ought to — they ought to be terrific. But if you make biscuits today and do so again next weekend and the weekend after and the weekend after that, they will be terrific, the best biscuits ever. This is a matter of practice related to what martial artists call kata — a set pattern that rewards repetition with excellence.", "They’re popping up all over the dining world: huge, elaborate arrangements of faux blossoms and plants — many of them the work of one enterprising man. Marigolds don’t generally thrive in 30-degree weather. Yet on a cool March afternoon, they bloomed in golden bunches outside Bungalow, a new Indian restaurant in the East Village. The petals appeared perky and thriving, as did the man, Carlos Franqui, expertly twisting them into a colorful archway that crawled around the entrance.", "And plenty more minimum-effort, maximum-rewards dinner ideas. Hang on to your hats, because Hetty Lui McKinnon has done it again. Why do we all go so nuts for Hetty’s recipes? Because she somehow manages to coax maximum character out of minimal ingredients, techniques and prep work. Her creations are always satisfying and never fussy, a true boon for busy people who care deeply about what they cook.", "This spring menu — a showstopping frittata, a snappy salad and a chewy cookie from a celebrated restaurant chef — isn’t just surprising. It’s surprisingly simple. No matter what’s going on outside, by the end of March, it can be pretty much spring in the kitchen. It’ll probably be a few weeks until the season’s produce trickles in, but this shouldn’t stop you from making a meal that feels jubilantly of the moment.", "Snacking for the Masters, a benefit for a culinary careers program and a fond farewell to this column. Add cassava to that wardrobe of tortillas. A new line, Coyotas, is an alternative to flour tortillas. It uses gluten-free organic cassava flour and organic coconut oil with only water and salt. The result behaves like flour tortillas, holds up well with fillings and comes in three sizes: small for tacos, medium for larger tacos and quesadillas, and large for burritos and other wraps. The company, based in San Diego, was started by Janet Flores Pavlovich, a native of Hermosillo in Sonora, in Northern Mexico, where the flour tortilla reigns. She learned to make them in her hometown and while she was at it, innovated by using cassava flour. And in one of those felicitous culinary accidents like the Toll House cookie, wound up with a gluten-free product. There are 12 in a pack of small, eight of medium and six of large; three packs for $37.50.", "Eric Kim’s bacon and egg don is extremely delicious, and extremely simple. If you eat meat, or have ever eaten meat, then I probably don’t need to mount an argument for bacon, a food so powerfully appealing that science has sought to explain the reasons why. Bacon is transformative in cooking, elevating other ingredients that share the bun, pan or plate. That, of course, includes eggs, which don’t need bacon’s help to be delicious, but become even more so in a New York-style breakfast sandwich or a bowl of spaghetti carbonara.", "A seafood bar opens above Claud, the former chef of Maharlika and Jeepney turns to Italian cuisine, and more restaurant news. It took Riccardo Giraudi, the Monte Carlo native with a global empire of Beefbars and other brands, 20 years to finally open a restaurant in New York. The TriBeCa space that had housed the original Nobu is now fitted with plush upholstery and 90 seats, an open kitchen and a separate bar area in the former Nobu Next Door. Mr. Giraudi, whose family has been in the wholesale meat business in Monaco since 1968 and whose restaurants in Europe showcase American beef with great success, is in partnership in the United States with Tribeca Hospitality Group, for which this is their first venture. “If this works we have a huge opportunity in the United States,” said Aqib Rahman, who owns the group with other family members. Like many newly minted steakhouses, the owners insist this is “not a traditional steakhouse.” But just like the others there’s an emphasis on seafood. Other choices include items like a Black Angus kathi roll, Kobe beef gyozas, tuna rib-eye with shiso chimichurri, and Korean-style skirt steak. “There’s no sense in just bringing American steaks back to New York,” Mr. Giraudi said. Traditional cuts of Wagyu and Black Angus are served. The executive chef is Peter Jin. (Opens April 4)", "Irresistible honey-and-soy-glazed chicken thighs, a springy Easter menu and a one-pot dish sure to please. Some ingredient combinations are positively alchemical, imbuing dishes with a sublime character inexplicably greater than the sum of their parts. Garlic, red chile flakes and lemon is one such mixture; honey, soy sauce and ginger is another. You can add almost any protein or vegetable to these and be guaranteed a dinner worth its weight in gold.", "Using canned artichokes and frozen peas keeps this fresh meal simple to make all year long. Of all the reasons I fantasize about moving to Rome, the availability of precleaned artichokes is near the top of my list.", "Sheet-pan japchae makes easy work of caramelizing a rainbow of vegetables before tossing with noodles. Hello! It’s Eric Kim, reporting for duty and filling in for Mia Leimkuhler this week. How are we doing today?", "It can star in a creamy pasta or casserole, or be the understudy to kale in a spring minestrone. For almost two years, I had managed to avoid a New York inevitability: attending an improv comedy show. That streak came to an end this month.", "Cheap, unfussy and adaptable, these lentils call up warming memories of home and family for many South Asians. One of my favorite Hindi terms is “ghar ka khaana.” It literally means “home food,” but it also encompasses the singular joy and unfussiness of meals made in your own kitchen — the dishes that remind you of childhood, the ones you won’t often find in restaurants.", "Cabbage, crema, pico de gallo and a spritz of lime, please? In the business of reporting on and reacting to culture — whether it’s theater, film, music, books or restaurants — eventually something you write will end up in promotional advertising.", "There’s more to Austrian wines than grüner veltliner. Its reds range from juicy and refreshing to satisfyingly complex. Austria is best known for its white wines, grüner veltliners and rieslings primarily. But it also produces brilliant reds, which, because they often seem like afterthoughts, can be great values.", "Not for you? There’s always carrot maqluba, or a no-recipe recipe for kielbasa with pierogies. Good morning. What I smelled during a 10-minute bicycle ride today: wood smoke, diesel exhaust, grass, frying bacon, rotting wood, bleach, balloon rubber, dollar pizza, a tendril of burning weed, the sharpness of electrical ozone, cart coffee and, last, the strong, sweet scent of lilies — Easter in the air. Good Friday!", "Whether for a casual cookout or an elegant dinner party, these impressive recipes are easy to pull off. After the quiet winter months, spring heralds the return of longer days and gathering over leisurely meals. The best dishes for those get-togethers are the ones that feel celebratory enough to serve to guests, but are simple enough to ensure you’re not spending all day in the kitchen.", "Because you'll definitely need fuel for the dance floor. Because you'll definitely need fuel for the dance floor.", "In the South, many Black families have made and eaten chew bread — a dessert similar to a blondie — for generations. In the early 1950s, Lucinda Moore founded a church ministry from her home in Blount’s Creek, N.C. The property anchored the charity work she became known for: nursing sick people back to health in her house, giving needy people the clothes that hung in her closet, leading religious ceremonies in the church she helped build in the backyard and cooking dozens of meals every Sunday with staples like fried chicken, macaroni and cheese, candied yams and a favorite of the congregation, chew bread.", "Are you team raisins or no raisins? On the subject of raisins in carrot cake, the food writer Allison Robicelli once wrote for Taste Cooking, “They don’t just get to show up in desserts, acting like they belong there when they have no business stepping outside of the world of trail mix.”", "Deviled eggs, for sure. Maybe pickled eggs, cured with beets, vinegar and sugar, too? Good morning. I had a lovely run of Brooklyn sandwiches going, before work, school and Easter intervened to send me back to the kitchen. There was a classic Saigon-style bánh mì from Ba Xuyen in Sunset Park. A colossal roast beef, fried eggplant and mozzarella hero from Defonte’s in Red Hook, with hot peppers, gravy and mayonnaise. A ton-katsu sando on pillowy milk bread from Taku Sando in Greenpoint."]