["The celebrated Broadway performer, director and choreographer is asking $2.3 million for the apartment at 414 East 52nd Street, one of two he owns in the same co-op complex. Tommy Tune, the Broadway song-and-dance man, is selling a penthouse at the Southgate, a prewar co-op complex designed by Emery Roth on a quiet cul-de-sac facing the East River.", "If lack of cash is keeping you from buying a house, you may have options. If lack of cash is keeping you from buying a house, you may have options.", "Take a look at major residential real estate listings and sales, including Kathy Hilton's Hamptons home. Take a look at major residential real estate listings and sales, including Kathy Hilton's Hamptons home.", "Single men traditionally get a head start in homeownership and reap the benefits faster, but single women are thinking creatively to close the gap. Rachel Rodman always dreamed of owning her own home, but life kept getting in the way.", "Your mortgage lender can sell the servicing of your loan to a different company. You can’t stop that, but you can protect yourself. Q: Here at Ask Real Estate, we recently received a reader’s question about poor treatment by mortgage servicers. Many first-time home buyers don’t realize that the lender that approves their mortgage could turn around and sell the servicing rights to a company they’ve never heard of. Now the homeowner might have to deal with a mortgage servicer that has bad customer service, charges late fees when it shouldn’t, or makes needless demands on borrowers. How can you protect yourself from having to do business with a bad mortgage servicer?", "Many artworks commissioned by the rich and powerful for their final resting places have rarely been seen by the living for the last century. On a sunny Bronx morning late last year, an all-star team of stained-glass experts prepared to enter a dank 1894 tomb at Woodlawn Cemetery that had been opened just once in the past century.", "During the quarantine, a couple worked hard on an application for the city’s housing lottery, and their efforts paid off: a two-bedroom for $1,241 a month in Long Island City. When the pandemic began, Susannah Dalton and José Ignacio Vivero were living in a basement apartment in Sunnyside, Queens. “It wasn’t bad during Covid,” Ms. Dalton said, “because it had a strong bunker feel and that was the vibe back then. This was back in the early days when we were, like, Windexing groceries.”", "A midcentury-modern retreat in Palm Springs, a hillside house in wine country and a three-bedroom home with a guesthouse and recording studio in Topanga. This 1957 house was designed by William Krisel, a prolific local architect, and has been owned by the same family for four decades. It was recently renovated, and additions included new appliances and cherry-wood cabinets in the kitchen and round soaking tubs in the bathrooms.", "A division of Mr. Buffett’s conglomerate was added to a string of defendants in an antitrust lawsuit that alleges brokerages inflated commissions that home sellers were forced to pay. HomeServices of America, the largest residential real estate brokerage in the United States and owned by Warren E. Buffett’s Berkshire Hathaway Energy, is now at the center of a nationwide antitrust lawsuit with potential implications on the structure of real estate commissions nationwide.", "Even a quarter of a century ago, the one-bedroom bungalow was a bargain. Several renovations later, it’s the home of their dreams. Even a quarter of a century ago, the one-bedroom bungalow was a bargain. Several renovations later, it’s the home of their dreams.", "The Philadelphia rowhouse once owned by the jazz musician will be restored through funds provided by the African American Cultural Heritage Action Fund and the Andrew W. Mellon Foundation. The American jazz musician John Coltrane bought a three-story brick rowhouse in Philadelphia’s Strawberry Mansion neighborhood in 1952, using it as his primary residence or a stopping point when on tour until he died in 1967.", "Even a quarter of a century ago, the one-bedroom house was a bargain in Los Angeles. Several renovations later, it’s the home of their dreams. As families grow and space needs change, the conventional move is to trade one home for another. Rebecca Rudolph and Colin Thompson would say it doesn’t have to be that way.", "‘Lemons and limes are really great houseplants,’ said the owner of a rare-plants nursery in Connecticut — if you choose the right ones. Shattering the glass ceiling isn’t always a goal — not if you’re a certain beloved lemon tree growing in a Victorian-era greenhouse.", "A hillside home of Spanish architects has a skin made of colorful tubes. Lucía Cano and José Selgas are architects who have no fear of color. Founders of the studio SelgasCano in Madrid, they designed a conference center in Cartagena, Spain, that looks like a translucent organ glowing orange from within as if it were coursing with alien blood. Their Serpentine Pavilion — one of the famed temporary experimental structures displayed in London each summer — was a sprawling, tentacled cocoon with misty rainbow bands.", "Buildings made shaggy with vegetation or fragrant with wood are no longer novelties. In the lineup of climate villains, architecture towers above many. The building and construction industries account for some 37 percent of worldwide carbon dioxide emissions, according to the United Nations Environment Program. Three of the most commonly used building materials — concrete, steel and aluminum — generate nearly a quarter of all carbon output.", "A cottage in Southwest Harbor, a two-bedroom condominium in Miami Beach and a four-bedroom bungalow in Seattle. This house is in Southwest Harbor, a small town on Mount Desert Island. It is less than a five-minute drive from the popular campgrounds, hiking trails and beaches in Acadia National Park, and about the same distance from the late 19th-century Claremont Hotel and from a drugstore, a coffee shop and several seafood restaurants on Main Street.", "Homeowners are adding hidden doors and rooms to foil burglars, eke out extra storage space and prepare for Armageddon. Tabitha Kane is a co-host of a true crime podcast so it might not come as a complete surprise to learn that when she and her husband were planning a new house for their family in Dallas, she cooked up the idea of adding a secret room.", "Respecting your neighbor’s privacy is a friendly instinct. But you might have to get aggressive to ensure everyone else’s well-being. Q: I am on the board of a small co-op in Manhattan. One of our residents is very private, and possibly a hoarder. He refuses to allow anyone to enter his apartment, even the super. The managing agent has tried contacting this resident by phone and by letter so he can investigate a foul smell that is likely coming from the apartment, but the resident does not respond. The resident’s family member who has helped us in the past has been unreachable. How do we respect this person’s privacy while also making sure that his apartment isn’t disturbing others?", "This week’s properties are a two-bedroom in Pound Ridge, N.Y., and a four-bedroom in Ridgefield, Conn. A two-bedroom, two-bath, 1,805-square-foot home built in 1940, with a living room that has a lavish stone fireplace and floor-to-ceiling windows, a kitchen with a breakfast nook, a cozy formal dining room, a bright family room with bay windows facing the yard, a basement with a gym, a breezeway to a two-car heated garage, a large bluestone patio, a built-in firepit, a heated in-ground gunite pool and a large converted barn with living space, on 2.36 acres. Bonnie Stein, Julia B Fee Sotheby’s International Realty, 914-262-0915, williampitt.com", "Nationally, one-year rent increases have leveled out, but local conditions may vary. On the national level, rental rates have flattened over the past year — which is good news following the head-spinning increases of 2022 into 2023. But as Zumper’s February rent report points out, how much a renter should expect to pay in 2024 is highly dependent on where they live, with a record amount of new inventory in Western and Southwestern regions offset by low-supplied markets in the Midwest and Northeast.", "This week’s properties are in Harlem, Chelsea and Bedford-Stuyvesant. A one-bedroom, one-and-a-half-bath, 900-square-foot garden-level duplex with a large foyer, an eat-in kitchen with an integrated dishwasher, a full bathroom, a bedroom and a balcony on the first level; and a living area, office nooks, a half bath, a washer and a vented dryer hookup on the lower level; plus a private backyard, ample storage and mini-split heating and air-conditioning, in a five-story prewar building with a virtual intercom. Laura Cook, Keller Williams NYC 917-935-8140; kwnyc.com", "A couple loved living in Sea Gate, Brooklyn, so much that they wanted to share the experience with others. So they looked for a distressed property they could restore and rent to a low-income tenant. A couple loved living in Sea Gate, Brooklyn, so much that they wanted to share the experience with others. So they looked for a distressed property they could restore and rent to a low-income tenant.", "A cottage in Nunhead Green, a two-bedroom apartment in Wapping and a three-bedroom duplex in Kingsland Basin. This updated house, with a traditional Victorian exterior and contemporary interior, is on a quiet street in Southeast London’s Nunhead Green Conservation Area, close to a small village area with a new community center, fish store, greengrocer, deli and pubs. The London skyline is visible from the parklike Nunhead Cemetery. Neighboring Peckham Rye has an expansive park and common area with a Japanese garden, sports facilities, cafes, bars, restaurants and shops.", "Dividing the marital home in divorce can be a financially and emotionally fraught experience. As soon as she knew her husband wasn’t coming back, Terri Martin logged onto Facebook Marketplace and bought a 1949 General Electric refrigerator for $5. Her marriage might be over, she thought, but her relationship with her home certainly wasn’t.", "When a neighbor left her a fortune, she didn’t buy a bigger house. She turned her cottage into a place where Marie Antoinette might have felt at home. When a neighbor left her a fortune, she didn’t buy a bigger house. She turned her cottage into a place where Marie Antoinette might have felt at home.", "When a neighbor left her a fortune, she didn’t buy a bigger house. She turned her cottage into a place where Marie Antoinette might have felt at home. Bonnie McIlvaine has lived in three homes in San Diego County, all on the very same spot.", "Alloy Development decided to keep gas appliances out of its new building, 505 State Street, for sustainability. The rule that would have required that move goes into effect in 2026. In an ever-changing Downtown Brooklyn, high-rise apartment buildings nearing completion are a familiar sight. But there’s something a bit different about the one at 505 State Street.", "A three-bedroom house in Glendale, a Craftsman bungalow in San Francisco and a two-bedroom condominium in a gated retirement community in Carmel. This recently updated house is on a sloping street in the Woodbury neighborhood, about a five-minute drive from public elementary, middle and high schools, and 10 minutes from the Americana at Brand shopping center and the Glendale Galleria mall.", "When the writer built a dream home for his family, he forgot to include one important thing: a place to write. So he found an unconventional solution. When the writer built a dream home for his family, he forgot to include one important thing: a place to write. So he found an unconventional solution.", "When the writer built a dream home for his family, he forgot to include one important thing: a place to write. So he found an unconventional solution. The cedar-shingled house that Andre Dubus III built for his family in the seaside town of Newbury, Mass., has four levels that sprawl across 6,000 square feet, with plenty of rooms that could have made a nice writer’s office. But Mr. Dubus plies his trade down in the mechanical room, near the exercise equipment and the boiler, in a lofted space that he built himself out of plywood.", "An A-frame cabin in Greene County, a renovated bungalow in Columbus and a 1911 home outside Philadelphia. This house is five minutes from Prattsville, a Greene County town with a diner, a tavern and a grocery store, and a 10-minute drive from a number of Catskill Mountains hiking and biking trails. Hunter Mountain, a popular ski resort, is 20 minutes away. The town of Catskill, on the banks of the Hudson River, is a 45-minute drive.", "This week’s properties are a six-bedroom in Chatham, N.J., and a five-bedroom in Scarsdale, N.Y. A six-bedroom, five-and-a-half-bath, colonial-style house built in 1977 and renovated and expanded in 2008, with a new chef’s kitchen that has two islands and high-end appliances, a family room, a great room with a retractable movie screen and gas fireplace, formal dining and living rooms, a primary bedroom suite with an adjacent office, an au pair suite, a finished basement, two laundry rooms and an attached two-car garage, on 0.52 acres. Debbie Woerner, Coldwell Banker, 973-500-3032; coldwellbanker.com", "This week’s properties are in Morningside Heights, Murray Hill and Williamsburg. A one-bedroom, one-bath, 810-square-foot apartment with an open floor plan, a breakfast bar, a large marble bathroom with a double vanity, a walk-in closet, casement windows, central air-conditioning and a washer/dryer, on the 10th floor of a 41-story doorman new development with a live-in resident manager, super, porter, basement storage, private parking garage and three floors of amenities including a gym, swimming pool, children’s playroom and library. Danika Dorsey, Corcoran Sunshine Marketing Group; 212-246-2100, corcoran.com", "More than a third of U.S. homeowners plan to stay in their homes forever, according to a new survey. As if it weren’t difficult enough to find a home to buy these days, a new study reveals that more than a third of all American homeowners plan to stay in their current homes forever.", "With a new job at Bryn Mawr and a grandchild on the way, an academic looked for the things she couldn’t afford in Manhattan: more space, more green, more parking. With a new job at Bryn Mawr and a grandchild on the way, an academic looked for the things she couldn’t afford in Manhattan: more space, more green, more parking.", "A 108-block sidewalk restoration project led by the Central Park Conservancy balances historical aesthetics with modern needs. The sidewalks surrounding Central Park were designed to help you escape.", "An industrial loft in La Villette, a former workshop in Sainte-Avoye and an updated apartment with 19th-century touches on Île Saint-Louis. This two-bedroom loft is in the vibrant La Villette district, formerly a neighborhood of slaughterhouses in northeast Paris that has been undergoing redevelopment since the 1980s. The 136-acre La Villette Park, with concert halls, museums, theaters, event spaces and other cultural venues, is less than 10 minutes away on foot. A comparable walk in the other direction arrives at the Bassin de la Villette, the largest artificial lake in Paris, and a bohemian area offering shops, restaurants and bars, boating and other attractions.", "Jeremiah Brent, the newest cast member of Netflix’s “Queer Eye,” shows how he styles the shelves in the home he shares with his husband, Nate Berkus. In a public library, styling a bookshelf is easy: Just fill it with books. At home, a bookcase needs to do a lot more than hold books.", "Interior designer Jeremiah Brent offers guidance on how to style bookshelves. Interior designer Jeremiah Brent offers guidance on how to style bookshelves.", "The influential National Association of Realtors agreed to make several changes to its policies to settle class-action lawsuits brought by home sellers who say they were forced to pay inflated commissions to real estate agents. In the early hours of Friday morning, the National Association of Realtors agreed to a global settlement deal that would resolve several lawsuits against the trade group.", "The National Association of Realtors will pay $418 million in damages and will amend several rules that housing experts say will drive down housing costs. American homeowners could see a significant drop in the cost of selling their homes after a real estate trade group agreed to a landmark deal that will eliminate a bedrock of the industry, the standard 6 percent sales commission.", "The law permits landlords to make upgrades in rent-stabilized units, but that doesn’t mean your rent has to go up. Q: I am a senior citizen and have lived for almost 50 years in a small building in Queens. My apartment is the only rent-stabilized unit in the building. The landlord is installing a new heating system in the building, which will involve major work in my apartment to install new pipes. The current system works well, and it appears the installation of a new system is mainly to bring in more rent for the landlord. Do I have to allow this work in my unit? Will my rent increase once the new heating system is functioning?", "The National Association of Realtors has agreed to change its policies to settle several lawsuits brought by home sellers — a move that could reduce commissions. A settlement reached this week threatens to strike a blow to an established standard of residential real estate: the 6 percent sales commission. It also will change who pays it. The deal, reached after a yearslong court battle initially brought by a group of home sellers in Missouri, calls for the powerful National Association of Realtors, which has long regulated the way U.S. homes are sold, to amend its rules on how Realtors for sellers and buyers are compensated.", "One quarter of residents in the French capital live in government-owned housing, part of an aggressive plan to keep lower-income Parisians — and their businesses — in the city. The two-bedroom penthouse comes with sweeping views of the Eiffel Tower and just about every other monument across the Paris skyline. The rent, at 600 euros a month, is a steal.", "After renting their first New York apartment sight unseen, they decided to take a new place in the South Bronx with eyes wide open. Altin Sencalar’s timing could hardly have been worse.", "A Victorian-style home in San Rafael, a ranch house in Santa Barbara and a Spanish-style home in Los Angeles. This house was built to replace a Victorian house that burned down 100 years after it was built on this lot, and the designers attempted to recreate as many Victorian-era details as possible. It is about a mile from the center of the city, putting it within a five-minute drive or a 20-minute walk of shopping, dining and the Smith Rafael Film Center, an Art Deco theater showing independent films.", "For one Brooklyn family, color was all-important. So was renovating on a budget. For one Brooklyn family, color was all-important. So was renovating on a budget.", "For one Brooklyn family, color was all-important. So was renovating on a budget. As Giovanni Botta and Amanda Pinegar began planning their renovation of the house they bought in Prospect-Lefferts Gardens, Brooklyn, they knew one thing for sure: The kitchen would have to be pink.", "New changes to the way homes are bought and sold are causing confusion among buyers, sellers and real estate agents. We want to hear your experience of selling a home in New York City in 2024. In the aftermath of the recent legal settlement calling for the National Association of Realtors to amend its rules on how Realtors are compensated for a home sale, many home buyers and sellers across the United States are wondering how the changes will affect them.", "The architect of Bergen, in Boerum Hill, is Frida Escobedo, who recently landed the commission to redesign a wing of the Metropolitan Museum of Art. To fit into Boerum Hill, Brooklyn, known for its brownstones and low-key style, new buildings must follow a pattern: be stately but not flashy, and above all honor the integrity of the neighborhood.", "A three-bedroom condominium in an Edwardian house in San Francisco, a Craftsman bungalow in Tampa and an 1881 home in Providence. This floor-through apartment is in a building near Mission Dolores Park, one of the city’s most beloved outdoor spaces, with picnic areas, a playground and tennis courts. It is also just a few blocks from Mission San Francisco de Asis, a late 18th-century Spanish-style church; Roxie Theater, one of the city’s oldest continuously operating movie theaters; and the popular Tartine bakery. Public elementary, middle and high schools are within a 15-minute walk.", "Many U.S. homeowners are staying put rather than selling, even if they’d prefer to move. These days, renovating may be a better bet. If you bought a home before mortgage rates shot up to their current levels, congratulations — you’re probably paying much less each month than you would if you moved today and borrowed again. That’s why so many homeowners are staying put, even if they’d prefer to move. ", "This week’s properties are Lenox Hill, Yorkville and Holliswood. A roughly 500-square-foot studio apartment that has a windowed kitchen with a dishwasher, a dressing room, a windowed bathroom, an electric fireplace, large tilt-and-turn windows and through-the-wall air-conditioning, on the 16th floor of a 17-story doorman building with a live-in resident manager, porters, shared laundry, bike storage, basement storage lockers and a package room. Lisa Chajet, Coldwell Banker Warburg, 212-439-5199; cbwarburg.com", "This week’s properties are a five-bedroom in Old Westbury, N.Y., and a three-bedroom in Riverside, Conn. A five-bedroom, four-and-a-half-bath house from 1953, with an entry foyer, a formal dining room, an eat-in kitchen, a sunken living room with a fireplace, a family room, an en suite primary bedroom, a finished lower level with a fireplace and access to the backyard, and a two-car garage, on one acre. Lois Kirschenbaum, Daniel Gale Sotheby’s International Realty, 516-526-7425; danielgale.com.", "Most real estate agents in the city are not affiliated with the National Association of Realtors. Here’s how the group’s recent blockbuster settlement will affect buying and selling homes in New York City. Last week, the National Association of Realtors settled a series of lawsuits brought by home sellers, agreeing to pay $418 million in damages and eliminate its longstanding rules on broker commissions. The deal, which still needs a federal court’s approval, would eliminate the standard 6 percent commission on home sales and pave the way for a system in which sellers no longer pay the entire commission.", "Unable to afford a single-family home near their jobs, a young family took a chance on a mobile-home park near the beach. Here’s what they found. Unable to afford a single-family home near their jobs, a young family took a chance on a mobile-home park near the beach. Here’s what they found.", "Entire sections of this tiny New York City home can shift and change, depending on the time of day and what the occupants need. Once Michael Mance and Shannie Easterby adopted a child, it didn’t take long to realize that a 400-square-foot apartment wasn’t going to work for them anymore.", "Customers raised $250,000 to save Boris & Horton from closure. Now its owners are negotiating with landlords and working to stay open with changes to their business model. A triumphant mood hung in the air at the East Village cafe Boris & Horton, as good boys and good girls scampered, barked, sprawled and ogled an array of treats.", "The art dealer has listed his West Village duplex, which he pieced together from three apartments, for $5.5 million. (And, yes, the contemporary art and furnishings are also for sale.) For the last several years, the gallery owner Leo Koenig has been busy creating his own work of art: his West Village home.", "An A-frame lakefront chalet in La Minerve, a ski-in-ski-out condo in Mont-Tremblant, and a modern house in a development in the village of La Conception. Set on the shore of Lake Chapleau, a popular fishing spot, this peaked-roof chalet is in La Minerve, a municipality in the Laurentians region of Quebec. Mont-Tremblant, with its ski resorts, golf courses, dining and private airport, is about 30 miles southeast. Hiking and snowmobile trails crisscross the wooded terrain around the property. A commercial strip with a supermarket, bakery, hardware store and library is about a mile north. Montreal is about 109 miles southeast.", "As long as this dog isn’t biting people, it’s probably not going anywhere. But that doesn’t necessarily mean you have to live with the noise. Q: My husband and I have lived in a co-op in Westchester County for 37 years. It’s a three-story building that prohibits dogs as pets, and we’ve always had a great relationship with the other residents. But nine months ago, our upstairs neighbors acquired an emotional support dog for their teenager. The dog runs back and forth for 30 minutes at a time. At least three nights a week, it scratches a bedroom rug, waking us up throughout the night. We have shared our concerns with the neighbors, asking them to crate the dog at night and walk him when he’s rambunctious. They seemed receptive, but the problem persists. How can we balance the rights of people to have emotional support animals with our right to live peacefully?", "Real estate experts say that getting a judgment is a lot easier than foreclosing on a major piece of real estate. And pinning a value to Trump’s buildings is a guessing game. Rejected by more than two dozen bond companies, Donald J. Trump has so far been unable to come up with the nearly half-a-billion dollar penalty owed by Monday in his civil fraud trial.", "Economists and real estate experts warn that changes in how agents are paid could have unintended consequences for people buying their first homes. With a landmark legal settlement poised to upend a decades-old norm that has dictated who pays real estate agents and how much, economists, agents and lenders are beginning to worry that the burden could now be on first-time home buyers.", "A two-bedroom condominium in San Francisco, a three-bedroom cottage in Los Angeles and a ranch house in San Luis Obispo. This condominium is in Cow Hollow, a few blocks from the Fillmore Street shopping corridor and from walking trails winding through the Presidio, one of the city’s largest public parks. It is less than a mile from the Palace of Fine Arts, built for the Panama-Pacific International Exposition of 1915, and less than a 10-minute drive from Crissy Field East Beach, which offers sweeping views of the Golden Gate Bridge.", "Nathan Connolly and the estate of Shani Mott, who recently died, will receive a payment from their mortgage lender, which also agreed to several policy changes to discourage discrimination. A Black couple who claimed an appraisal company undervalued their Baltimore home based on their race have settled their lawsuit against their mortgage lender, loanDepot, which has agreed to a number of sweeping policy changes that could offer significant relief to homeowners who allege racially biased appraisals in the future.", "Lawmakers say preservationists held too much power over decisions on whether buildings should be demolished and what should be allowed to replace them. The oceanfront Eden Roc Hotel is an icon of Miami Modernist architecture, a style that epitomized the postwar glamour and grandeur of Miami Beach. Two turquoise panels wrap the white facade. The oval canister perched atop the building resembles a cruise ship’s funnel. Crooners like Frank Sinatra, Harry Belafonte, and Sammy Davis, Jr., stayed and played there.", "You won’t stop at just one, once you discover what they can do for your garden: “People get obsessed.” Matthew and Timothy Nichols’s story could be a case study of what it means to manifest something. The goal they realized: To amass an enviable collection of Japanese maples and establish a leading role in championing them.", "Your entryway has been working hard all winter. But it’s a new season: Time to lighten things up. It may not feel like spring yet — but it is.", "A converted 1840 schoolhouse in Phoenixville, a one-bedroom condominium in Portland and a two-story house in New Orleans. This home, known as the Old Pickering Schoolhouse, still has much of its interior woodwork intact, along with its belfry (and the bell inside it). It is about a five-minute drive from Phoenixville High School and less than 10 minutes from the center of town, which has an early 20th-century movie theater, a brewery and walking paths along French Creek, a tributary of the nearby Schuylkill.", "After several lawsuits brought by home sellers, the rules around buying and selling properties are about to change. After several lawsuits brought by home sellers, the rules around buying and selling properties are about to change.", "Six home sellers in Missouri successfully argued that the powerful real estate trade group’s rules on commissions forced them to pay inflated fees. When Rhonda Burnett went to sell a home in 2016, she knew she would have to pay a commission to her real estate agent.", "Real estate taxes on single-family homes increased about 24 percent from 2019 to 2023. The median price for a single-family home in the United States rose about 40 percent from 2019 to 2022, peaking at $480,000 before receding to about $417,000 at the close of 2023. The higher home prices have led to higher property taxes, adding even more to a monthly housing budget. A recent study by CoreLogic found that from 2019 through 2023, the median U.S. single-family property-tax bill rose by about 24 percent, to about $2,826.", "The estate of Maurice Kanbar, an entrepreneur, is selling his Upper East Side home. There is an art gallery on the first two floors and four vacant rental apartments upstairs. Maurice Kanbar never saw the sense in accepting things as they were. The lifelong inventor and entrepreneur, who died in 2022 at age 93, developed, among other things, a comb for “defuzzing” sweaters, New York’s first multiplex cinema, and Skyy vodka, which he — somewhat dubiously — claimed wouldn’t leave you with a hangover.", "This week’s properties are in Manhattan Valley, Hell’s Kitchen and St. George. A two-bedroom, two-bath, 1,140-square-foot apartment with an open floor plan, a breakfast bar, a dining alcove, a primary suite with a walk-in closet and a balcony on the 11th floor of a 19-story doorman building with a live-in super, a package room, shared laundry, a bike room, parking, a gym, a children’s playroom, a residents’ lounge and a waiting list for basement storage cages. James Michael Angelo, Christie’s International Real Estate, 917-373-8343; christiesrealestate.com", "This week’s properties are five-bedroom homes in Paramus, N.J., and Chappaqua, N.Y. A five-bedroom, four-bath house built in 1950 but fully remodeled this year, featuring an open kitchen with a center island, dining area and living rooms and a separate family room and bedroom suite, four other bedrooms, a finished basement and one-car attached garage, a deck and a fenced yard on 0.25 acres. Besmir Vatoci, Realty One Group Legend, 201-294-2885; realtyonegroup.com", "Looking to explore a new neighborhood in Manhattan and create a better work setup, a couple embarked on a search for a prewar two-bedroom. Looking to explore a new neighborhood in Manhattan and create a better work setup, a couple embarked on a search for a prewar two-bedroom.", "During the Harlem Renaissance, some Black people hosted rent parties, celebrations with an undercurrent of desperation in the face of racism and discrimination. During the Harlem Renaissance, some Black people hosted rent parties, celebrations with an undercurrent of desperation in the face of racism and discrimination.", "A one-bedroom apartment near the Trevi Fountain, a two-bedroom duplex on the western edge of town, and a spacious pied-à-terre across from the Basilica of Santa Cecilia. This one-bedroom, one-bath apartment is on the top floor of a four-story 18th-century building near the Trevi Fountain. Built in the Renaissance style, it features cornices above the windows and wood shutters. An inscription above the main entry has the Latin motto, “Ne Gloriari Liberat Alienis Bonis” (“Do not boast of the merits of others”), taken from an ancient fable by Phaedrus.", "March's top sales include the former home of George Malkemus. March's top sales include the former home of George Malkemus.", "Private clubs have long shaped the fabric of New York social life. Many of them formed during the Gilded Age, meticulously designed to be showstoppers before Manhattan’s skyscrapers surrounded them. But in recent years, a new wave of clubs has pro... Private clubs have long shaped the fabric of New York social life. Many of them formed during the Gilded Age, meticulously designed to be showstoppers before Manhattan’s skyscrapers surrounded them. But in recent years, a new wave of clubs has proliferated, varying in price point, exclusivity and amenities.", "Some people belong to multiple private clubs that have emerged to fill physical and emotional voids. Others belong only to Sam’s Club. In a 115-year-old ferry terminal in New York’s financial district, an abundance of excess now exists. Walls lined with Loro Piana cashmere, Brooklyn Bridge views, a wellness center, a jazz bar — all of it can be yours for $3,900 annually (or just $2,500, if you’re under 30). Since it opened in 2021, Casa Cipriani has become one of the city’s buzziest private clubs.", "A lease rental bond guarantee, which covers losses if a tenant fails to pay the rent, may seem unnecessary. But your landlord can require one. Q: A year ago, when I applied for a market-rate apartment in the Bronx, the landlord required that I get a lease rental bond from a bond company. I have a good credit score, but the agent said my liquid assets were below the required threshold. In addition to the bond, I had to give them first month’s rent and a one-month security deposit before moving in. The bond cost me $1,000. I’ve been paying my rent on time through the company’s app, but now they’re telling me that I need to renew the bond for a new two-year lease. I have signed the lease; the landlord has not. If I say no to the bond and can’t work something else out, can I be evicted?"]