["The arachnids, which are not spiders, were thought to have only two eyes, compared with many more on spiders. Guilherme Gainett, then a biologist at the University of Wisconsin-Madison, was looking through a microscope at the embryo of a daddy longlegs when he saw it — or, rather, saw them. Daddy longlegs, the group of splendidly leggy arachnids also known as harvestmen, have been thought to have just two eyes. But there on the animal’s body, illuminated with fluorescent markers, were what looked like four more vestigial eyes.", "DNA has shown that the extinct humans thrived around the world, from chilly Siberia to high-altitude Tibet — perhaps even in the Pacific islands. Neanderthals may have vanished 40,000 years ago, but they are no strangers to us today. Their stocky skeletons dazzle in museums around the world. Their imagined personas star in television ads. When Kevin Bacon noted on Instagram that his morning habits are like those of a Neanderthal, he did not stop to explain that our ancient cousins interbred with modern humans expanding out of Africa.", "Two spacecraft have ended up askew on the lunar surface this year. It is easier to tip over in the weaker gravity on the moon than you may imagine. When the robotic lander Odysseus last month became the first American-built spacecraft to touch down on the moon in more than 50 years, it toppled over at an angle. That limited the amount of science it could do at the lunar surface, because its antennas and solar panels were not pointed in the correct directions.", "A new study suggests that the amount of the element on the moon of Jupiter is on the lower end of previous estimates. Under its bright, frosty shell, Jupiter’s moon Europa is thought to harbor a salty ocean, making it a world that might be one of the most habitable places in our solar system.", "She discovered new ways to promote regeneration in the nervous system, offering hope to countless paralyzed patients worldwide. Mary Bartlett Bunge, who with her husband, Richard, studied how the body responds to spinal cord injuries and continued their work after his death in 1996, ultimately discovering a promising treatment to restore movement to millions of paralyzed patients, died on Feb. 17, at her home in Coral Gables, Fla. She was 92.", "Archaeologists have revealed a major production site for one of history’s most luxurious, and smelliest, colorants. The most prized pigment of antiquity was processed not from a tangle of root or the frothy extract of a weed, but by drawing out a slimy secretion from the mucus glands behind the anus of murex sea snails — “the bottom of the bottom-feeders,” the historian Kelly Grovier has written. The common name of the dyestuff, Tyrian purple, derives from the habitat of the mollusks, which the Phoenicians purportedly began harvesting in the 16th century B.C. in the city-state of Tyre in present-day Lebanon.", "She linked her passion for the natural environment to the precepts of the Hebrew Bible, beginning with the Garden of Eden. Ellen Bernstein, a river guide turned rabbi who blazed a spiritual trail in the environmental movement by undergirding it with the Hebrew Bible’s veneration of nature, died on Feb. 27 in Philadelphia. She was 70.", "The last child of the pioneering ecologist Aldo Leopold, she also helped preserve her father’s legacy as a founder of the modern environmental movement. Estella Bergere Leopold, a botanist who examined ancient pollen to illuminate the effects of climate change — and who, as the last child of the pioneering environmentalist Aldo Leopold, helped preserve her father’s legacy as a founder of the modern conservation movement — died on Feb. 25 at a retirement home in Seattle. She was 97.", "Sunflower sea stars, a species of giant starfish, are critically endangered. Researchers tinkered with sperm in an aquarium lab to help them reproduce. On Valentine’s Day, Melissa Torres strung up red tinsel hearts around a shallow pool at her workplace, the Birch Aquarium at Scripps Institution of Oceanography in La Jolla, Calif. She and her colleagues were arranging a romantic encounter of sorts, and the stakes were high. The happy couple, a pair of sunflower sea stars, belonged to a species that has nearly vanished because of climate change.", "Russian President Vladimir V. Putin may find that a nuclear weapon in orbit is less useful for war than intimidation. In 1982, President Ronald Reagan was considering what became known as “Star Wars,” a plan to shield America from Soviet missiles by deploying up to thousands of weapons in space. At the same time, as a young science writer, I was reporting on how the rays from a single nuclear detonation in orbit could wipe out whole fleets of battle stations and laser death rays. “Star Wars: Pentagon Lunacy,” read one of the headlines.", "The results could shed light on why the animals rarely get cancer. But the researchers’ ultimate goal of bringing back woolly mammoths is still aspirational. When the biotechnology firm Colossal started in 2021, it set an eyebrow-raising goal: to genetically engineer elephants with hair and other traits found on extinct woolly mammoths.", "A new paper challenges the idea that the large, carnivorous Spinosaurus dived after prey rather than wading and plucking it out of the water. Spinosaurus was one of the largest carnivorous dinosaurs, and it ate fish. That much paleontologists agree on.", "Gray whales are regularly found in the North Pacific, but sightings in the Atlantic, from which they had vanished by the 18th century, are extremely rare. Researchers with the New England Aquarium were conducting a regular survey of the waters south of Martha’s Vineyard and Nantucket in Massachusetts last week when something caught their eye.", "His groundbreaking research, which he performed with Yvonne Barr, his doctoral student, uncovered the first virus capable of causing cancer in humans. In March 1961, Dr. Anthony Epstein, a pathologist at Middlesex Hospital in London, almost skipped a visiting physician’s afternoon lecture about children with exceptionally large facial tumors in Uganda.", "A green honeycreeper spotted on a farm in Colombia exhibits a rare biological phenomenon known as bilateral gynandromorphism. Colombia is a bird watcher’s paradise. Its stunningly diverse ecosystems — which include mountain ranges, mangrove swamps, Caribbean beaches and Amazonian rainforests — are home to more avian species than any other country on Earth.", "When a seagrass shortage caused a mass manatee die-off, scientists rushed to save the orphaned young. After three years at a zoo, the manatees are now grown up and going back to the wild. The photographer Jason Gulley explains how ZooTampa rescues... When a seagrass shortage caused a mass manatee die-off, scientists rushed to save the orphaned young. After three years at a zoo, the manatees are now grown up and going back to the wild. The photographer Jason Gulley explains how ZooTampa rescues manatees, cares for them and eventually releases them back into the wild.", "Amphibians called caecilians add cloacal secretions of a nutritious material similar to milk to their numerous quirks, according to a new study. Motherhood takes many shapes. Most vertebrates, like birds, reptiles, amphibians and fish, reproduce by laying eggs filled with nourishing yolk that their offspring use as an initial source of nutrition before hatching. Mammals change the game by giving birth to live young and feeding them fatty, sugary milk as they get on their feet.", "In 1983, he commanded a Challenger shuttle flight. After the 1986 disaster, he was charged with leading NASA’s return to space. Richard Truly, a naval aviator and astronaut who flew aboard two early space shuttle missions and, as NASA’s associate administrator, guided the agency’s return to space after the Challenger disaster, died on Feb. 27 at his home in Genesee, Colo. He was 86.", "The National Science Foundation takes a step (just one) toward an “extremely large telescope.” The United States should commit $1.6 billion to building an “extremely large telescope” that would vault American astronomy into a new era, according to the National Science Board, which advises the National Science Foundation.In a statement on Feb. 27, the board gave the foundation until May to decide how to choose between two competing proposals for the telescope. The announcement came as a relief to American astronomers, who have been fretting about losing ground to their European colleagues in the quest to examine the heavens with bigger and better telescopes.", "The populations of some Latin American birds are declining, even in the countries they symbolize. The American tropics are uniquely blessed with birds. Thirty-six percent of the world’s 11,000 bird species live in the region south of the border between the United States and Mexico, more than in Asia or Africa.", "A nova named T Coronae Borealis lit up the night about 80 years ago, and astronomers say it’s expected to put on another show in the coming months. If you keep a close eye on the night sky in the weeks and months ahead, you may spot something new. It will shine as bright as Polaris, the North Star, for no longer than a week before fading back into darkness.", "While the sentinel trees of Northern Lebanon may not be as old as some traditions hold, one tree might be more than 1,000 years old. Olive trees are common in Northern Lebanon, but in the village of Bshaaleh, a handful look downright ancient. Their branches grow in wildly unpredictable directions, and the trees’ gray, gnarled trunks are shot through with holes and crevasses large enough to hide a sleeping child. Many people believe these sentinel trees are thousands of years old. They are known as “Noah trees” because of some people’s belief that the trees are the source of the olive branch carried by the dove back to Noah’s ark.", "Given troves of data about genes and cells, A.I. models have made some surprising discoveries. What could they teach us someday? In 1889, a French doctor named Francois-Gilbert Viault climbed down from a mountain in the Andes, drew blood from his arm and inspected it under a microscope. Dr. Viault’s red blood cells, which ferry oxygen, had surged 42 percent. He had discovered a mysterious power of the human body: When it needs more of these crucial cells, it can make them on demand.", "The findings, from the largely uncharted waters of Bounty Trough, show that “we’ve got a long way to go in terms of understanding where life is found in the ocean,” a researcher said. A team of 21 scientists set off on an expedition in the largely uncharted waters of Bounty Trough off the coast of the South Island of New Zealand in February hoping to find a trove of new species.", "In February, Peter Kaestner beat out the competition to document his 10,000th bird species. On Feb. 9, Peter Kaestner stood in the shadow of majestic Tinuy-an Falls on the Philippine island of Mindanao, on the cusp of a record he’d spent seven decades chasing and worried that he’d arrived too late.", "In 2014 a fireball from outer space was posited to be an alien artifact. A recent study suggests otherwise. In January of 2014, a meteor fell from space off the coast of Papua New Guinea. That might have been the end of it, but several years later Avi Loeb, a theoretical astrophysicist at Harvard, drew on seismic data from near the site, looked for crash remains on the ocean floor and proposed that the remains “may reflect an extraterrestrial technological origin.”", "A new study reveals that cicadas can discharge urine with far more force than their size would suggest. This spring’s output could be significant. This spring, when the ground temperature hits 64 degrees Fahrenheit, trillions of cicadas will dig their way up from beneath the soil across the Southern and Midwestern United States. In a rare so-called double emergence, two distinct cicada broods — one on a 13-year life cycle and the other on a 17-year one — will take to the trees to sing, eat and mate.", "Scientists never imagined that the blind cave salamanders called olms willingly left their caves. But at numerous aboveground springs, there they were. Scientists have discovered that blind cave salamanders in northern Italy leave their underground homes to go on expeditions to the surface.", "An 11th-century astrolabe, a complex instrument for precisely mapping the heavens, recently turned up in an Italian museum. ", "Despite a common narrative that male mammals tend to dwarf female ones, fewer than half of mammalian species display that pattern, a new study suggests. Female elephant seals are not delicate creatures. They are rippling tubes of muscle and blubber that can weigh more than 1,000 pounds. Still, female elephant seals are absolutely dwarfed by their male counterparts, which are typically at least three times heavier.", "A new study argues that the change brought these females an evolutionary advantage — and perhaps did the same for humans. Menopause is all too familiar to women, but in other species it’s remarkably rare. Last year, scientists reported that females in a single population of chimpanzees live long past their reproductive years. But aside from chimps and humans, researchers have found clear evidence of menopause in only five species — all of them whales.", "Bigger than the Statue of Liberty, the SpaceX vehicle is central to NASA’s plans to get to the moon and Elon Musk’s dreams of the red planet. For Elon Musk, Starship is really a Mars ship. He envisions a fleet of Starships carrying settlers to the red planet in the coming years.", "While SpaceX has a major head start on the way to orbit, Blue Origin has a plan to put an uncrewed spacecraft on the moon in 12-16 months. Which billionaire space company will get to the moon first: Elon Musk’s SpaceX or Jeff Bezos’ Blue Origin?", "Seeing plasma build up beneath a spacecraft in near-real time is uncommon. Just past the 45-minute mark of the Starship vehicle’s journey through space on Thursday, something eerie happened. As it drifted high above Earth’s oceans and clouds, the spacecraft’s silvery exterior was overtaken by a brilliant and fiery orange glow.", "The third test flight of the most powerful rocket ever built achieved a series of milestones before the spacecraft was lost as it re-entered Earth’s atmosphere. The third try turned out to be closer to the charm for Elon Musk and SpaceX, as his company’s mammoth Starship rocket launched on Thursday and traveled about halfway around the Earth before it was lost as it re-entered the atmosphere.", "April 8 could be your best opportunity to see a total solar eclipse for decades. But if clouds fill the sky, you may miss the spectacle. April 8 could be your best opportunity to see a total solar eclipse for decades. But if clouds fill the sky, you may miss the spectacle.", "The quiet withdrawal of a 2021 cancer study by Dr. Sam Yoon highlights scientific publishers’ lack of transparency around data problems. The quiet withdrawal of a 2021 cancer study by Dr. Sam Yoon highlights scientific publishers’ lack of transparency around data problems.", "The observation suggests that seals join cobras, archerfish and other animals known to spit, although researchers can only speculate about the reason for the mammal’s expectoration. On Jan. 3, 2022, Clare Jacobs, a bird-watcher, was delighted to spot a rare white-tailed eagle, or Haliaeetus albicilla, at a nature reserve on the Isle of Wight in southern England. These birds, also known as sea eagles or ernes, vanished from the region some 250 years ago, but more than two dozen birds have been released on the island since 2019.", "The writer and filmmaker discusses the blend of theoretical cosmology and Black culture in Chicago’s newest planetarium show. On Feb. 17, the Adler Planetarium in Chicago unveiled a new sky show called “Niyah and the Multiverse,” a blend of theoretical cosmology, Black culture and imagination. And as with many things Afrofuturistic, Ytasha Womack’s fingerprints are all over it.", "To decarbonize the electrical grid, companies are finding creative ways to store energy during periods of low demand. Central Sardinia is not generally considered a hotbed of innovation: Arid and rural, some of its road signs riddled with bullet holes made by target-practicing locals, the setting recalls a Clint Eastwood western. Yet in Ottana, on the brownfield site of a former petrochemical plant, a new technology is taking shape that might help the world slow climate change. The key component of this technology is as unlikely as the remote location: carbon dioxide, the chief cause of global warming.", "A new study of camera-trap images complicates the idea that all wildlife thrived during the Covid lockdowns. In the early months of the Covid pandemic, when every bit of news seemed bleak, there was one heartwarming narrative that took hold: With humans stuck in their homes, the world was safe again for wild animals, which could now wander freely through cities, parking lots or fields that once might have been crowded with people.", "The Apollo-Soyuz mission, amid the Cold War, broke new ground in space cooperation when an American capsule docked with a Soviet craft 140 miles above the earth. Thomas P. Stafford, an astronaut who pioneered cooperation in space when he commanded the American capsule that linked up with a Soviet spaceship in July 1975, died on Monday in Satellite Beach, Fla. He was 93.", "He broke barriers as the first Black physicist in nearly every role. But his identity made him reach for dreams beyond his career as a scientist. The day before Walter Massey turned 30, in 1968, the Rev. Dr. Martin Luther King Jr. was fatally shot on a hotel balcony in Memphis. Dr. Massey, then a physicist at Argonne National Laboratory, watched the funeral on television, in tears, from his apartment in Chicago. Outside, the west side of the city was burning.", "The superbly preserved remains of a Bronze Age settlement offer a glimpse of a “colorful, rich, varied” domestic life circa 850 B.C. Three millenniums ago, a small, prosperous farming community briefly flourished in the freshwater marshes of eastern England. The inhabitants lived in a clutch of thatched roundhouses built on wooden stilts above a channel of the River Nene, which empties into the North Sea. They wore clothes of fine flax linen, with pleats and tasseled hems; bartered for glass and amber beads imported from places as far-flung as present-day Iran; drank from delicate clay poppyhead cups; dined on leg of boar and honey-glazed venison, and fed table scraps to their dogs.", "The study, based on research featured in a Netflix documentary, fueled debate over a site that is used for Islamic and Hindu rituals. The American publisher of a study that challenged scientific orthodoxy by claiming that an archaeological site in Indonesia may be the world’s “oldest pyramid” says it has been retracted.", "Michel Talagrand of France has credited a brush with blindness for leading to the work that resulted in his recognition by the math equivalent of the Nobel Prize. A French mathematician is the recipient of this year’s Abel Prize, the math equivalent of the Nobel, for advances in understanding randomness in the universe — the heights of ocean waves crashing on a beach, the weights of babies, the ups and downs of the stock market — work that has found use in mathematical physics and statistics.", "How do you design an app for a parrot? Consider games that are “made to be licked,” a new study suggests. Parrots have much in common with toddlers. The brainy birds can learn to recognize colors and shapes, manipulate objects, build large vocabularies and make their needs known at improbably high volumes. They are also playful, intelligent and curious; without ample cognitive enrichment, they quickly become bored.", "An archaeological site in Ethiopia revealed the oldest-known arrowheads and the remnants of a major volcanic eruption. In 2002, a crew of paleoanthropologists were working in northwestern Ethiopia when they came across chipped stones and fossilized animal bones — telltale signs of a place where ancient people had once lived.", "The studies, pulled because of copied data, illustrate the sluggishness of scientific publishers to address serious errors, experts said. Scientists in a prominent cancer lab at Columbia University have now had four studies retracted and a stern note added to a fifth accusing it of “severe abuse of the scientific publishing system,” the latest fallout from research misconduct allegations recently leveled against several leading cancer scientists.", "An unusually popular primatologist, he drew the attention of Newt Gingrich, Isabella Rossellini, the philosopher Peter Singer and the reading public. Frans de Waal, who used his study of the inner lives of animals to build a powerful case that apes think, feel, strategize, pass down culture and act on moral sentiments — and that humans are not quite as special as many like to think — died on Thursday at his home in Stone Mountain, Ga. He was 75.", "A nearly 2,000-year-old stash pouch provides the first evidence of the intentional use of a powerful psychedelic plant in Western Europe during the Roman Era. In 2011, archaeologists in the Netherlands discovered an ancient pit filled with 86,000 animal bones at a Roman-Era farmstead near the city of Utrecht. It fell to Martijn van Haasteren, an archaeozoologist at the Cultural Heritage Agency of the Netherlands, to sort through them.", "Two musky steroids, and higher levels of odorous acids, distinguish the body odors of adolescents and tots. Few parents would describe the smells emanating from their adolescent children as redolent of sandalwood. But one of the distinct components of teenage body odor is a compound that evokes that warm, woody fragrance, according to a small new study, which compared the scents of adolescents to those of infants and toddlers.", "The species seemed to have bug eyes and a smile, so a team of researchers named it Kermitops gratus in honor of the banjo-playing Muppet. One crawled across the rain-drenched ground of what is now Texas more than 270 million years ago, possibly feasting on fast-moving insects. The other endeared himself to millions as the banjo-playing roving newscaster, and reluctant beau of Miss Piggy, known as Kermit the Frog.", "Dante Lauretta, the planetary scientist who led the OSIRIS-REx mission to retrieve a handful of space dust, discusses his next final frontier. Last fall, a NASA spacecraft named OSIRIS-REx dropped a capsule containing more than 120 grams of space dust into the Utah desert. That material came from Bennu, an asteroid that, a billion years ago, broke off from a bigger world that may have hosted liquid water. Studying this material will clarify the role that asteroids might have played in bringing life’s ingredients to Earth.", "These are answers to common questions about the April 8 eclipse. These are answers to common questions about the April 8 eclipse.", "These are answers to common questions about the April 8 eclipse, and we’re offering you a place to pose more of them. On April 8, North America will experience its second total solar eclipse in seven years. The moon will glide over the surface of our sun, casting a shadow over a swath of Earth below. Along this path, the world will turn dark as night.", "How champion skaters' brains keep them from falling or feeling dizzy How champion skaters' brains keep them from falling or feeling dizzy", "Victor Glover, a nine-year veteran of the astronaut corps who will fly around the moon in 2025, said the search for excellence and diversity were not mutually exclusive. Do you dream of leaving the planet?", "More lost shipwrecks are being found because of new technology, climate change and more vessels scanning the ocean floor for science or commerce. Some were fabled vessels that have fascinated people for generations, like Endurance, Ernest Shackleton’s ship that sank in the Antarctic in 1915. Some were common workhorses that faded into the depths, like the Ironton, a barge that was carrying 1,000 tons of grain when it sank in Lake Huron in 1894.", "The subtle event, known as a penumbral eclipse, can be observed by everyone on Earth’s nightside. As the moon prepares to blot out the surface of our sun in two weeks, it’s warming up with a penumbral lunar eclipse on Sunday night or Monday morning, depending on your time zone.", "Astronomers have gotten better at tracking the motions of stars just beyond the solar system. But that’s made it harder to predict Earth’s future and reconstruct its past. Regardless of what stock market analysts, political pollsters and astrologers might say, we can’t predict the future. In fact, we can’t even predict the past.", "On April 8, the moon will cast a shadow across much of North America. On April 8, the moon will cast a shadow across much of North America.", "U.S. regulators confirmed that sick cattle in Texas, Kansas and possibly in New Mexico contracted avian influenza. They stressed that the nation’s milk supply is safe. A form of avian influenza that is highly fatal in birds has been confirmed in U.S. dairy cattle in Texas and Kansas, the Department of Agriculture announced on Monday.", "What new research on the avian brain and REM sleep in birds might reveal about our own dream lives. I once dreamed a kiss that hadn’t yet happened. I dreamed the angle at which our heads tilted, the fit of my fingers behind her ear, the exact pressure exerted on the lips by this transfer of trust and tenderness.", "A new study suggests that two killer whale populations in the North Pacific are distinct enough to be considered separate species. Killer whales are some of the most cosmopolitan creatures on the planet, swimming through every one of the world’s oceans. They patrol the frigid waters near both poles and periodically pop up in the tropics, in locations from western Africa to Hawaii.", "Researchers examined fossils of the predatory worm and found a new species that persisted for 25 million years after it was believed to have become extinct. With a head covered in rows of curved spines, ancient Selkirkia worms could easily be confused with the razor-toothed sandworms that inhabit the deserts of Arrakis in “Dune: Part Two.”", "Dr. Goodall, who is best known for her work with chimpanzees, recently celebrated her forthcoming 90th birthday with as many dogs and explained why she isn’t slowing down. Jane Goodall is turning 90 on April 3 and the primatologist-turned-activist seems busier than ever. This year, she’ll be on the road for 320 days. She’ll be raising money for her nonprofit organizations, the Jane Goodall Institute and Roots & Shoots, and encouraging people to take environmental action.", "How do champion skaters accomplish their extraordinary jumps and spins? Brain science is uncovering clues. ", "The Delta IV Heavy, a rocket that briefly bursts into flame just before it lifts off, is set to launch for the last time soon. The ignition of the Delta IV Heavy rocket is perhaps the most visually striking liftoff you’ll ever see — the rocket seemingly burns itself up on the launchpad before it heads to space. Now, the very last Delta IV Heavy ever is on the launchpad.", "A device called LightSound is being distributed to help the blind and visually impaired experience this year’s event. On Aug. 21, 2017, Kiki Smith’s teenage sons giddily prepared to watch the partial solar eclipse in Rochester, N.Y. As Ms. Smith listened to their chatter, she felt excluded.", "The rendezvous between the sun and the moon in 2017 captivated a small region in the Midwest. Lucky for Americans at the eclipse crossroads, they get to see it again. It is rare for a total solar eclipse to hit the same place twice — once every 366 years on average. In 2019, this happened in the Pacific Ocean, far west of the coast of Chile. By a stroke of luck, the next one will span a region of about 10,000 square miles that includes parts of southern Illinois, southeastern Missouri and western Kentucky."]