[["https://www.tiktok.com/@bbcnews/video/7358548367745731872", "Frenchman Damien Guerot has been hailed a hero for confronting the Sydney mall attacker on Saturday."], ["https://www.tiktok.com/@bbcnews/video/7358548460431232289", "MPs have backed a UK smoking ban that would aim to stop anyone born after 2009 buying cigarettes."], ["https://www.tiktok.com/@bbcnews/video/7358527056071773473", "Praying for my trampoline right now."], ["https://www.tiktok.com/@bbcnews/video/7358525885831564577", "What do you think about banning people born in or after 2009 from EVER buying cigarettes?"], ["https://www.tiktok.com/@bbcnews/photo/7358503816926481697", "People on Chinese social media think the plans for a new station in Nanjing look like a sanitary pad."], ["https://www.tiktok.com/@bbcnews/video/7358488300727880993", "The three-time Olympic gold medallist says he is learning to balance his Christian faith with his fighting mentality ahead of the Paris Olympics this summer."], ["https://www.tiktok.com/@bbcnews/video/7358467297880640800", "Anyone making explicit images of an adult without their consent in England and Wales will face a criminal record under the new law."], ["https://www.tiktok.com/@bbcnews/video/7358418026904980769", "A Muslim student at Michaela School in London has lost a High Court challenge against its ban on prayer rituals."], ["https://www.tiktok.com/@bbcnews/video/7358412247430958369", "The lighting of the flame in Greece's ancient Olympia kicks off an international torch relay, which ends at the Paris 2024 Olympic Games."], ["https://www.tiktok.com/@bbcnews/video/7358403239785614625", "Everyone in the building, which is one of the city's oldest, was able to leave before the tower collapsed."], ["https://www.tiktok.com/@bbcnews/video/7358376633637571872", "The building is one of Copenhagen's oldest, dating back to 1625."], ["https://www.tiktok.com/@bbcnews/video/7358200299888086305", "Former UK Prime Minister Liz Truss has addressed the “lettuce-cam”, calling it “pathetic”."], ["https://www.tiktok.com/@bbcnews/video/7358203031239806240", "Former UK Prime Minister Liz Truss has said the “world was safer” when Donald Trump was president of the US."], ["https://www.tiktok.com/@bbcnews/video/7358177026672577825", "Hannah Gutierrez-Reed was the movie set weapons handler who loaded a gun for actor Alec Baldwin before it fired and killed cinematographer Halyna Hutchins."], ["https://www.tiktok.com/@bbcnews/video/7358157469983493409", "Parents and teachers spent two years fundraising to allow the school to replace books."], ["https://www.tiktok.com/@bbcnews/video/7358162753665633568", "How gusty is it where you are?"], ["https://www.tiktok.com/@bbcnews/video/7358151722176367905", "Thurman Maoyibei’s accounts vanished over the weekend, after she made up a story about a boy losing his homework in Paris."], ["https://www.tiktok.com/@bbcnews/video/7358146376485621024", "Five years after a devastating fire, this is what Notre-Dame looks like now…"], ["https://www.tiktok.com/@bbcnews/video/7358147293838593313", "Ahead of the world's biggest election, Prime Minister Narendra Modi's ruling party is trying to increase its presence in India's southern state of Tamil Nadu."], ["https://www.tiktok.com/@bbcnews/video/7358121628645051680", "26-year-old Adam Garrett was sentenced to four years in prison at Reading Crown Court."], ["https://www.tiktok.com/@bbcnews/video/7358124698279873824", "Colin Smith died from Aids aged seven. He was a haemophiliac, and was given infected blood as a baby."], ["https://www.tiktok.com/@bbcnews/video/7358117998349045024", "The Titanic sank on this date in 1912, leading to the deaths of more than 1,500 people."], ["https://www.tiktok.com/@bbcnews/photo/7358075003788692769", "Here are the key moments from Coachella 2024."], ["https://www.tiktok.com/@bbcnews/video/7358063475584781601", "Hannah Waddingham, who was the host at this year's Olivier Awards, called out a photographer who apparently asked her to \"show leg\"."], ["https://www.tiktok.com/@bbcnews/video/7358055887644183840", "Author Sir Salman Rushdie was attacked on stage two years ago, as he was preparing to give a lecture."], ["https://www.tiktok.com/@bbcnews/video/7358054528559664417", "The stabbing comes days after six people were killed at a shopping mall in the same city, but there's no suggestion that the two events are linked."], ["https://www.tiktok.com/@bbcnews/video/7358042848014486816", "51-year-old David Stephenson was sentenced to eight years and six months in jail. The elderly woman was unharmed."], ["https://www.tiktok.com/@bbcnews/video/7358033935785332000", "Nicole Scherzinger won Best Actress in a Musical for her role as Norma Desmond in Sunset Boulevard."], ["https://www.tiktok.com/@bbcnews/video/7358030675993234720", "Look at all those chickens..."], ["https://www.tiktok.com/@bbcnews/video/7357773735505497377", "To be, or not to be? Stars of theatre are gearing up for tonight’s 2024 Olivier Awards."], ["https://www.tiktok.com/@bbcnews/video/7357777590658010401", "For the first time ever, Iran has carried out strikes against Israel. Here's what we've been able to verify about the footage so far."], ["https://www.tiktok.com/@bbcnews/video/7357000767619763488", "“What keeps me going is the people out there.”"], ["https://www.tiktok.com/@bbcnews/video/7357019688871726368", "Amina was one of 276 girls abducted from their school in Chibok."], ["https://www.tiktok.com/@bbcnews/video/7357646344535788832", "The attack is a retaliation for an Israeli strike that killed an Iranian military commanders in Damascus, Syria earlier this month."], ["https://www.tiktok.com/@bbcnews/photo/7357622757607214368", "Israel has said it and its allies have intercepted the vast majority of more than 300 drones and missiles launched by Iran."], ["https://www.tiktok.com/@bbcnews/video/7357018489208524064", "Millions of people have fled Sudan’s civil war, where there is nowhere to buy food."], ["https://www.tiktok.com/@bbcnews/video/7357367447785147681", "One person has been killed and 10 others have been injured after a cable car cabin collided with a broken pole on Friday."], ["https://www.tiktok.com/@bbcnews/video/7357316192056479008", "Witnesses at the scene said the officer ran towards the man, telling him to put down his knife, before shooting him once in the chest."], ["https://www.tiktok.com/@bbcnews/video/7357311906702511392", "A civilian has been recorded holding off a man who fatally stabbed six people at a Sydney shopping centre."], ["https://www.tiktok.com/@bbcnews/video/7356963825205136672", "Blue Peter find an extraordinary home on wheels that had its very own fold-away car..."], ["https://www.tiktok.com/@bbcnews/video/7357299215829077280", "Six people have died and several are in hospital after a stabbing attack at a Sydney mall, police have said."], ["https://www.tiktok.com/@bbcnews/video/7357049726354656544", "One suspect was arrested while another fled the scene, after a “strange” police chase that involved an officer borrowing an onlooker’s bike."], ["https://www.tiktok.com/@bbcnews/video/7357035069200026913", "Not me getting an A* for some kickflips..."], ["https://www.tiktok.com/@bbcnews/photo/7357053854036315424", "Their programme, Meet The Richardsons, returned for its fifth series to Dave's UKTV on 8 April."], ["https://www.tiktok.com/@bbcnews/video/7357032897309658400", "Truong My Lan committed one of the biggest bank frauds the world has ever seen."], ["https://www.tiktok.com/@bbcnews/video/7357030238297001248", "Tensions are high over the possibility Iran will retaliate for an air strike that killed senior Iranian commanders nearly two weeks ago."], ["https://www.tiktok.com/@bbcnews/video/7357027628986993953", "Northumbria Police said it was investigating a \"report of malicious communications\" involving inappropriate content aimed at young people."], ["https://www.tiktok.com/@bbcnews/video/7357025221506796833", "Do you think sports companies should make single shoes available to buy?"], ["https://www.tiktok.com/@bbcnews/video/7356964322741931296", "Samba girlies have firmly said Rishi CANNOT sit with us 🙅‍♀️"], ["https://www.tiktok.com/@bbcnews/video/7356955248256224545", "Arizona recently reinstated a law from 1864 that bans nearly all abortions in the state."], ["https://www.tiktok.com/@bbcnews/photo/7356947507005443360", "The iconic Paris cathedral's spire and roof collapsed in a fire in April 2019, but the main structure was saved."], ["https://www.tiktok.com/@bbcnews/video/7356715978757066016", "\"I know how much work went into it, how much effort the team put into every microsecond.\""], ["https://www.tiktok.com/@bbcnews/video/7356715805884697889", "\"I definitely did not expect this.\""], ["https://www.tiktok.com/@bbcnews/video/7356695485471673633", "Samantha Beart is up for Best Performer in a Leading Role at the 2024 Bafta Games Awards."], ["https://www.tiktok.com/@bbcnews/video/7356689070140951841", "Yuri Lowenthal and Nadji Jeter are both up for Best Performer in a Leading Role at the 2024 Bafta Games Awards."], ["https://www.tiktok.com/@bbcnews/video/7356685745660415265", "Mizzy says going to jail made him realise he needed to \"change his life\"."], ["https://www.tiktok.com/@bbcnews/video/7356678016732368161", "Would you play Phil Wang's game?"], ["https://www.tiktok.com/@bbcnews/video/7356661756728544545", "Instagram's new tools aim to spot people trying to blackmail others with nudes."], ["https://www.tiktok.com/@bbcnews/video/7356646180119498016", "Did you and your mates buy tickets?"], ["https://www.tiktok.com/@bbcnews/video/7356630245300210977", "OJ Simpson, the former American footballer who was controversially cleared of double murder, has died aged 76, his family says."], ["https://www.tiktok.com/@bbcnews/video/7356606118711266593", "Ellen Mercer died two weeks after she was left bedbound by burning her legs with a laughing gas canister."], ["https://www.tiktok.com/@bbcnews/video/7356589426287332640", "Big day for people who like paying fictional rent."], ["https://www.tiktok.com/@bbcnews/video/7356583716791012640", "Well... we'll be steering clear of your vault, Aaron."], ["https://www.tiktok.com/@bbcnews/video/7356571956197494048", "Caroline’s mum said her family “won’t stop until we get the truth”."], ["https://www.tiktok.com/@bbcnews/photo/7356578278011931936", "Staff are clearing several metres of pumice and ash thrown out by Vesuvius almost 2,000 years ago from the area."], ["https://www.tiktok.com/@bbcnews/video/7356560954814942496", "Is there *anything* she can't do?"], ["https://www.tiktok.com/@bbcnews/video/7356552904955776288", "It's giving Hunger Games... 🏹"], ["https://www.tiktok.com/@bbcnews/video/7356541146723618081", "Truong My Lan has been sentenced to death for taking billions of dollars from one of the country's largest banks over a period of 11 years."], ["https://www.tiktok.com/@bbcnews/video/7356299454321823008", "The UN says 500 aid lorries are required daily for the people of Gaza."], ["https://www.tiktok.com/@bbcnews/video/7356290945119227169", "I wish I took PE seriously…."], ["https://www.tiktok.com/@bbcnews/video/7356282987538910496", "Dr Tijion Esho admitted to an improper emotional relationship with the woman, but denied it was physical."], ["https://www.tiktok.com/@bbcnews/video/7356282912041553184", "Eid al-Fitr - which means \"festival of the breaking of the fast\" - is celebrated at the end of Ramadan."], ["https://www.tiktok.com/@bbcnews/video/7356280847068089633", "Is it going to be Mad Love or a Bad Romance with audiences? 🤡🃏♦️"], ["https://www.tiktok.com/@bbcnews/video/7356266836280855841", "It's even got a picket fence!!"], ["https://www.tiktok.com/@bbcnews/video/7356242597918100769", "Sabrina Khan’s mum died when Spire Healthcare failed to transfer her to NHS intensive care quickly enough."], ["https://www.tiktok.com/@bbcnews/video/7356242660207709472", "What do you miss when you're fasting?"], ["https://www.tiktok.com/@bbcnews/video/7356214206909123872", "✨Checks passport expiry date immediately.✨"], ["https://www.tiktok.com/@bbcnews/video/7356199637025377568", "To mark the end of Ramadan, Eid al-Fitr prayers were held by the ruins of the al-Farouk mosque in Rafah, which was destroyed in February during an Israeli offensive."], ["https://www.tiktok.com/@bbcnews/photo/7356152308692045088", "Picking between Hugh and Leo would be a choice nobody envies."], ["https://www.tiktok.com/@bbcnews/video/7356146425698258209", "Jennifer and James Crumbley's son Ethan shot dead four students at a school in Michigan in 2021. They are the first parents of a US school shooter to be convicted for involuntary manslaughter."], ["https://www.tiktok.com/@bbcnews/video/7355952291079327008", "The RAF flight was one of 14 aircraft from nine nations each delivering 10 tonnes of aid to Gaza, on such a large scale to mark the end of Ramadan."], ["https://www.tiktok.com/@bbcnews/video/7355914258288250145", "The deadline is fast approaching..."], ["https://www.tiktok.com/@bbcnews/video/7355935858291117345", "Of the remaining 129 hostages, Israel believes at least 34 people are dead however Hamas says the number is higher. "], ["https://www.tiktok.com/@bbcnews/video/7355925537811860768", "Security will be increased at Champions League games this week due to threats by Islamic State group."], ["https://www.tiktok.com/@bbcnews/video/7355914315465051425", "*Adds 17th May to calendar*"], ["https://www.tiktok.com/@bbcnews/video/7355913330290085152", "Know any Harry Styles fans who’d be good for this?"], ["https://www.tiktok.com/@bbcnews/video/7355891225976638752", "March is the 10th month in a row to set a new climate record."], ["https://www.tiktok.com/@bbcnews/video/7355877016337386785", "Jonathan Majors has been found guilty of assaulting his ex-girlfriend, British choreographer Grace Jabbari."], ["https://www.tiktok.com/@bbcnews/video/7355873316198124833", "Alan Bates, the former sub-postmaster who led the campaign to expose the Horizon IT scandal, is giving evidence at the Post Office inquiry."], ["https://www.tiktok.com/@bbcnews/video/7355834090437758240", "Made in Chelsea’s Louise Thompson has spoken about her struggles with ulcerative colitis, which she was diagnosed with in 2018."], ["https://www.tiktok.com/@bbcnews/video/7355811648919145760", "Habibur Masum was detained early on Tuesday morning following the death of 27-year-old Kulsuma Akter on Saturday."], ["https://www.tiktok.com/@bbcnews/video/7355783198095314209", "In just under two hours, the total solar eclipse had travelled from Mexico, across 13 US states and into Canada."], ["https://www.tiktok.com/@bbcnews/video/7355563352770350369", "Any chance the make-up and hair team are free for my next night out?"], ["https://www.tiktok.com/@bbcnews/video/7355567923626249505", "According to Nasa, an estimated 31.5 million people across North America will get to see the Moon perfectly block the Sun, turning the skies completely dark for up to four minutes."], ["https://www.tiktok.com/@bbcnews/video/7355557396326010144", "Will price increases stop you from getting your nails done?"], ["https://www.tiktok.com/@bbcnews/video/7355543029257669921", "The bride’s mum ended up spending around £11,000 on last minute flights to Thailand for her friends."], ["https://www.tiktok.com/@bbcnews/video/7355542346290711841", "Well that's awkward... #JCole"], ["https://www.tiktok.com/@bbcnews/video/7355535181211503904", "Kulsama Akter from Oldham was fatally stabbed to death while pushing her baby in a pram in Bradford."], ["https://www.tiktok.com/@bbcnews/video/7355498102335245601", "Cody Fisher was stabbed to death by a masked group at a Birmingham nightclub in December 2022."], ["https://www.tiktok.com/@bbcnews/video/7355480435482217761", "Director Sam Taylor-Johnson and Marisa Abela share why they think Amy Winehouse would \"hopefully feel proud\" of the film about her life."], ["https://www.tiktok.com/@bbcnews/video/7355479040163122464", "Black to Black director Sam Taylor-Johnson said she wanted to meet Amy Winehouse's husband Blake Fielder-Civil before filming, but wasn't able to."], ["https://www.tiktok.com/@bbcnews/video/7355461914106875169", "What's your favourite Amy track?"], ["https://www.tiktok.com/@bbcnews/video/7355449937590504737", "E-bike and e-scooter fires are the fastest growing fire risk in London: statistics indicate there have been at least 40 this year."], ["https://www.tiktok.com/@bbcnews/video/7355440845513952545", "Russ Cook AKA the 'Hardest Geezer' has run the length of Africa over 352 days. Hope he's not running home."], ["https://www.tiktok.com/@bbcnews/video/7354364680925678880", "Dev Patel said he created Monkey Man with a British Asian action hero after being disappointed by the lack of representation in action films."], ["https://www.tiktok.com/@bbcnews/video/7354787842767310113", "People across North America will be treated to the view of a lifetime: a solar eclipse."], ["https://www.tiktok.com/@bbcnews/video/7354427910943411488", "There's been a 51% increase in prescriptions for ADHD medication since 2019, according to think tank the Nuffield Trust."], ["https://www.tiktok.com/@bbcnews/video/7354716186107481377", "Israel's military says it has recovered the body of hostage Elad Katzir from Gaza during an overnight raid on Khan Yunis."], ["https://www.tiktok.com/@bbcnews/video/7354409292553800992", "The performance was missing from the BBC Archive and was thought to have been lost forever. You can watch it and much more on a night of BBC Two ABBA specials on Saturday 6th."], ["https://www.tiktok.com/@bbcnews/video/7354462166000454945", "The dessert brand say Aldi are using an almost identical name, slogan and flavours as their product despite their trademarks."], ["https://www.tiktok.com/@bbcnews/video/7354453210527976736", "McDonald’s is hoping it can restore its reputation in the Middle East after widespread boycotts and protests against the fast-food chain."], ["https://www.tiktok.com/@bbcnews/video/7354438297831230753", "Mr Wragg told the BBC that he’d \"been subject to a sting operation by a very clever and manipulative operator\"."], ["https://www.tiktok.com/@bbcnews/video/7354427747768241441", "An Israeli military inquiry said that the unit involved believed the three WCK vehicles targeted with missiles had been taken over by Hamas gunmen."], ["https://www.tiktok.com/@bbcnews/video/7354427251712068896", "A magnitude 4.8 earthquake has been felt across New York and the surrounding areas."], ["https://www.tiktok.com/@bbcnews/video/7354409915256933665", "Are you seeing a rise in sexism at your school?"], ["https://www.tiktok.com/@bbcnews/video/7354338401732119840", "The Israeli military has sacked two senior officers after seven World Central Kitchen aid workers were killed in a strike in Gaza on Monday."], ["https://www.tiktok.com/@bbcnews/video/7354335454314908960", "The offer will mean some consultants will receive a pay increase of nearly 20%."], ["https://www.tiktok.com/@bbcnews/video/7354322772278922529", "Twenty-eight countries voted in favour, six against, and 13 abstained from the resolution calling for a weapons ban on Israel."], ["https://www.tiktok.com/@bbcnews/video/7354305963777625376", "“For your information, my back is fine, but my ego...”, French diver Alexis Jandard said."], ["https://www.tiktok.com/@bbcnews/video/7354088359792364832", "The pig kidney was modified to remove harmful pig genes and add certain human genes to improve its compatibility with humans."], ["https://www.tiktok.com/@bbcnews/video/7354051560227360032", "Two people were left injured after a Lamborghini and Corvette caused \"a chain reaction collision\" in Dallas, Texas."], ["https://www.tiktok.com/@bbcnews/video/7354029873494543649", "\"I wouldn't worry, we're not in the same class\" x"], ["https://www.tiktok.com/@bbcnews/video/7354024266599255329", "If you have a 12-step skincare routine you might want to hear this…"], ["https://www.tiktok.com/@bbcnews/video/7354009154224180513", "Piran Ditta Khan spent nearly two decades evading justice for his part in the killing of PC Sharon Beshenivsky in Bradford in 2005."], ["https://www.tiktok.com/@bbcnews/video/7353978047319624993", "Residents of Hualien recounted how the 7.4 magnitude earthquake shook homes, killing nine and injuring more than 1,000."], ["https://www.tiktok.com/@bbcnews/video/7353968700598340896", "Authorities said there were no injuries after passengers and crew reportedly jumped into the sea to escape the fire."], ["https://www.tiktok.com/@bbcnews/video/7353947177565080865", "A 7.4 magnitude earthquake hit near Taiwan's county of Hualien, killing nine and injuring more than 1,000."], ["https://www.tiktok.com/@bbcnews/video/7353922652823670048", "At least nine people have been confirmed dead after a magnitude 7.4 earthquake hit Taiwan."], ["https://www.tiktok.com/@bbcnews/video/7353916233487617313", "Staff were worried that a window nearby might break and injure the babies during the 7.4 magnitude earthquake."], ["https://www.tiktok.com/@bbcnews/video/7353716970329509153", "Don’t count your chickens just yet… any proposed changes wouldn’t come into effect until 2033."], ["https://www.tiktok.com/@bbcnews/video/7353713657022319905", "TT: Do you think companies should be able to use artists’ voices to make AI music?"], ["https://www.tiktok.com/@bbcnews/video/7353695598740000032", "The Teaching Regulation Agency's panel found that \"there is a real risk of Ms Morris repeating her offending behaviour\" and noted she was \"deliberate and sustained\". "], ["https://www.tiktok.com/@bbcnews/video/7353690729710882081", "\"I've been offered tons of trans roles, and I just don't want to do it.”"], ["https://www.tiktok.com/@bbcnews/video/7353683381042941216", "Police said the 23-year-old’s behaviour was “unacceptable”."], ["https://www.tiktok.com/@bbcnews/video/7353654305770999073", "Would you want to look after an elephant?"], ["https://www.tiktok.com/@bbcnews/video/7353645391247592737", "The Nigerian music star who just finished an East African tour said the fake report was ‘extremely irresponsible’."], ["https://www.tiktok.com/@bbcnews/video/7353635374364724513", "He was convicted of taking images of a total of 15 women from social media and uploading to porn websites."], ["https://www.tiktok.com/@bbcnews/video/7353644120654482721", "There are strict rules in the UK for adverts promoting low-calorie diets."], ["https://www.tiktok.com/@bbcnews/video/7353587683496611104", "Kirsten Dunst said she ‘didn’t even think to ask’ to be paid in line with the male actor."], ["https://www.tiktok.com/@bbcnews/video/7353584744061242656", "What do you think of the National Minimum Wage?"], ["https://www.tiktok.com/@bbcnews/video/7353576714619931936", "At least seven people have died and more than 70 are trapped in collapsed buildings following a 7.4 magnitude earthquake in Taiwan."], ["https://www.tiktok.com/@bbcnews/video/7353545140637601057", "The 7.4 magnitude earthquake set off tsunami warnings in Taiwan and in neighbouring countries. Some of these have since been retracted."], ["https://www.tiktok.com/@bbcnews/video/7353336526354353441", "22-year-old Faith Harrison started feeling unwell after a hockey game in January."], ["https://www.tiktok.com/@bbcnews/video/7353343031669427488", "A number of people - including the nightclub manager - have had warrants out for their arrest in connection with the fire."], ["https://www.tiktok.com/@bbcnews/video/7353331880889994529", "The Criminal Justice Bill could criminalise rough sleepers if they cause a \"nuisance\", including \"excessive smells\"."], ["https://www.tiktok.com/@bbcnews/video/7353311156091505953", "Why is it raining so much?"], ["https://www.tiktok.com/@bbcnews/video/7353305154726153505", "The ‘car cave’ in Gwynedd, Wales, went viral on social media - and now a group of cavers have been tidying up the mess left behind by influencers."], ["https://www.tiktok.com/@bbcnews/video/7353278560930417952", "Three British civilians were among the seven aid workers killed in an Israeli strike on a Gaza aid convoy, the charity World Central Kitchen has confirmed."], ["https://www.tiktok.com/@bbcnews/video/7353274092142775584", "Seven people working for a food aid charity were killed in an Israeli strike in Gaza."], ["https://www.tiktok.com/@bbcnews/video/7353244370985930017", "The German Football Association said a new number 4 design will be made."], ["https://www.tiktok.com/@bbcnews/video/7353231816892960032", "Do you think fans have a right to comment on stars’ relationships?"], ["https://www.tiktok.com/@bbcnews/video/7353219671862054176", "A child, aged 12, has been arrested after a deadly shooting at a primary school in Vantaa, Finland."], ["https://www.tiktok.com/@bbcnews/video/7353214872563305761", "The horse was having a bit of a mare."], ["https://www.tiktok.com/@bbcnews/video/7353176018946886945", "Three children have been wounded in a shooting at a school in the city of Vantaa in Finland, police have said."], ["https://www.tiktok.com/@bbcnews/video/7352951103610162464", "This BBC Panorama clip is believed to be one of the first televised April Fools' pranks."], ["https://www.tiktok.com/@bbcnews/video/7352955924589432096", "Germany has - on April 1 - partially legalised the use of the drug."], ["https://www.tiktok.com/@bbcnews/video/7352924677477682465", "Why is Scotland’s new hate crime controversial?"], ["https://www.tiktok.com/@bbcnews/video/7352591448220437793", "Gotta get that vitty D now the clocks have changed."], ["https://www.tiktok.com/@bbcnews/video/7352461769756953889", "It’s giving Final Destination 😳."], ["https://www.tiktok.com/@bbcnews/video/7351460903696485664", "\"He unzipped his jacket and pulled a gun out on us.\""], ["https://www.tiktok.com/@bbcnews/video/7351751897994333473", "The 'Assume That I Can' campaign starring Madison Tevlin went viral on World Down Syndrome Day."], ["https://www.tiktok.com/@bbcnews/video/7351442901303364897", "50 years ago an armed kidnapper, Ian Ball, attempted to abduct the young princess and hold her ransom."], ["https://www.tiktok.com/@bbcnews/video/7351849618096819488", "France's prime minister says a teenage girl will be sued by the state for falsely accusing her headteacher of striking her in a heated exchange over her wearing an Islamic head-covering."], ["https://www.tiktok.com/@bbcnews/video/7351836559169113376", "New video shows investigators inside the container vessel, Dali, to inspect damage and download the ship data."], ["https://www.tiktok.com/@bbcnews/video/7351823617283411233", "The FINALE of #DragRaceUK is tonight, but are you"], ["https://www.tiktok.com/@bbcnews/video/7351815922295835936", "In August 1945, Oppenheimer's nuclear bomb killed an estimated 140,000 people in Hiroshima and at least 74,000 people in Nagasaki. Today, the biopic about Oppenheimer's life was released in Japan."], ["https://www.tiktok.com/@bbcnews/video/7351779584020335905", "What’s your favourite track from the album? Fight in the comments x"], ["https://www.tiktok.com/@bbcnews/video/7351777761695993121", "Sir Jeffrey Donaldson has been charged with historical sexual offences and has quit as Democratic Unionist Party (DUP) leader."], ["https://www.tiktok.com/@bbcnews/video/7351747851308862753", "Is this happening at your school?"], ["https://www.tiktok.com/@bbcnews/video/7351719019310877985", "Forty-five people died and an eight-year-old girl, the only survivor, sustained serious injuries but is now in a stable condition."], ["https://www.tiktok.com/@bbcnews/video/7351500964999777569", "Tag your mate who would get a first on this course."], ["https://www.tiktok.com/@bbcnews/video/7351497623431351584", "Lioness Bethany England features in a BBC iPlayer documentary - Gay Marriage and Me, which looks at where marriage equality is at in 2024."], ["https://www.tiktok.com/@bbcnews/video/7351468278956543264", "Despite knowing their defence was untrue, a draft report uncovered by the BBC shows the Post Office spent £100m fighting sub-postmasters in court."]]