[["https://www.tiktok.com/@nytimes/video/7358580412630715694", "In New York City, trash has no dedicated space all its own."], ["https://www.tiktok.com/@nytimes/video/7358533993710505258", "The old stock exchange building in downtown Copenhagen partly collapsed in a large fire early Tuesday, videos show. The 17th-century building is one of the city’s oldest and best known structures."], ["https://www.tiktok.com/@nytimes/video/7358178272045337902", "Donald Trump faces charges he falsified business records to cover up a sex scandal while serving as president. Jury selection has begun, and the process could take two weeks or more. Follow live updates."], ["https://www.tiktok.com/@nytimes/video/7357098598036720942", "Protests over the Biden administration’s handling of the Israel-Hamas war are disrupting the activities of Democratic officials from city halls to Congress to the White House. Our political correspondent explains."], ["https://www.tiktok.com/@nytimes/video/7356670751971478830", "Roger, a Labrador retriever who is a search and rescue dog, found the 13th victim of the magnitude 7.4 earthquake in Taiwan. The failed drug-sniffing dog has captured hearts and offered moments of levity for a country reeling from the disaster."], ["https://www.tiktok.com/@nytimes/video/7356329363253562666", ""], ["https://www.tiktok.com/@nytimes/video/7356321593481563434", "\"Just a few generations ago, our two nations were locked in a devastating conflict,\" President Biden said as he hosted Prime Minister Fumio Kishida of Japan for a state visit as part of Biden's efforts to counter China’s aggressive actions in the Indo-Pacific region. \"Instead, we made a far better choice. We became the closest of friends.\""], ["https://www.tiktok.com/@nytimes/video/7356006108495924522", "U.S. election officials are facing a barrage of threatening messages ahead of November's presidential election. Our political reporter examined a file containing hundreds of violent messages against the Colorado secretary of state. Tap the link in our bio to follow more elections updates. Video by Nick Corasaniti and Mark Boyer."], ["https://www.tiktok.com/@nytimes/video/7355990592574442798", "For just over a week, Mount Etna, one of Europe’s most active volcanoes, has been spewing circular, mostly white smoke rings into the skies over Sicily. The phenomenon occurs when enough pressure builds up so that magma inside the crater propels condensed gases, predominantly water vapor, through the vent. Video by Giuseppe Di Stefano/Associated Press."], ["https://www.tiktok.com/@nytimes/video/7355959676451753258", "A data firm called MultiPlan works with big insurers to decide how much so-called out-of-network medical providers should be paid. It promises to help contain medical costs using fair and independent analysis. But MultiPlan and the insurance companies have a large and mostly hidden financial incentive to cut those reimbursements as much as possible, even if it means saddling patients with large bills, a New York Times investigation found. Our reporter breaks down how it works."], ["https://www.tiktok.com/@nytimes/video/7355652294098095403", "This is what it looked like as the full sweep of the moon's shadow crossed the U.S. on Monday — the first solar eclipse to be visible in the country in seven years."], ["https://www.tiktok.com/@nytimes/video/7355595018784099626", "President Biden announced on Monday a large-scale effort to help pay off federal student loans for tens of millions of American borrowers. His plan revives an effort that the Supreme Court blocked last year."], ["https://www.tiktok.com/@nytimes/video/7355556341244529963", "Correction officers and a captain stood by for seven minutes and 51 seconds as Nicholas Feliciano tried to hang himself in a Rikers Island jail cell in 2019, video obtained by The New York Times shows. New York City has agreed to pay more than $28 million to settle a lawsuit filed by the family of Feliciano, who suffered severe brain damage. If approved by a judge, it will be among the largest pretrial settlements ever to be awarded to a single plaintiff in a civil rights case in the city. Video by Nikolay Nikolov, Jan Ransom and Ainara Tiefenthäler."], ["https://www.tiktok.com/@nytimes/video/7354352877218843950", "Robbery and rape have long been a risk for migrants crossing the Darién Gap, but recently, there has been a sharp rise in sexual violence directed at women and girls. Julie Turkewitz and Federico Rios of The New York Times captured a snapshot of that violence, speaking with 14 women who said they had experienced sexual violence, ranging from forcible touching to rape."], ["https://www.tiktok.com/@nytimes/video/7354075075114552618", "Video shows people trapped in a mountainous area of Taiwan after a magnitude 7.4 earthquake triggered a landslide. The quake was the strongest to hit the island in 25 years."], ["https://www.tiktok.com/@nytimes/video/7354035672581262635", ""], ["https://www.tiktok.com/@nytimes/video/7353766552899980586", "World Central Kitchen has suspended its relief efforts in Gaza after seven aid workers were killed in Israeli airstrikes on Monday. Videos reveal the challenges of food distribution in a territory under siege."], ["https://www.tiktok.com/@nytimes/video/7353749719799352622", "The first quake in Taiwan was alarming enough — a rumble more powerful than anything felt there in a quarter-century, lasting for more than a minute on Wednesday morning, knocking belongings and even whole buildings askew. It was so strong it set off tsunami warnings in Japan, China and the Philippines."], ["https://www.tiktok.com/@nytimes/video/7353407569500622123", "Before and After Images Show What Remains of Al-Shifa Hospital. The hospital, which was the largest in Gaza, stood in ruins after a two-week raid by the Israeli military."], ["https://www.tiktok.com/@nytimes/video/7353343942546525483", "Seven aid workers were killed in the Gaza Strip when their convoy came under fire on Monday night, according to their aid organization, World Central Kitchen, and Gazan health officials."], ["https://www.tiktok.com/@nytimes/video/7352967886958333226", "Donald Trump has been ending his rally speeches with theatrical sermons complete with a cinematic music track, solidifying his growing deification among his supporters."], ["https://www.tiktok.com/@nytimes/video/7352948245385039147", "The musical \"Aladdin\" has been running on Broadway for 10 years, a bright spot in an industry that hasn't fully recovered from the pandemic. Michael Paulson, a theater reporter for The New York Times, attended the March 28 anniversary performance."], ["https://www.tiktok.com/@nytimes/video/7352561636726689067", "Thousands Rally Against Netanyahu’s Government in Tel Aviv"], ["https://www.tiktok.com/@nytimes/video/7351846709800209710", "\"Serial\" is back with Season 4. A history of Guantánamo told by people who lived through key moments in its evolution, who know things the rest of us don’t about being caught inside an improvised justice system. Episodes 1 and 2 are available now. Listen wherever you get your podcasts."], ["https://www.tiktok.com/@nytimes/video/7351831329404652843", "Why are more private clubs popping up in New York?"], ["https://www.tiktok.com/@nytimes/video/7351815517830810926", "Since leaving office in 2021, former President Donald J. Trump has spent more than $100 million on lawyers and other costs related to fending off various investigations, indictments and his coming criminal trials."], ["https://www.tiktok.com/@nytimes/video/7351471549347663134", "What happens when a columnist and a reporter use A.I. glasses to scan groceries, monuments and zoo animals?"], ["https://www.tiktok.com/@nytimes/video/7351462032702491934", "After several lawsuits brought by home sellers, the rules around buying and selling properties are about to change."], ["https://www.tiktok.com/@nytimes/video/7351094415940799787", "The authorities in Gaza said late Tuesday that 12 people had drowned while trying to retrieve airdropped aid that had fallen into the Mediterranean. They called for an end to the airdrops — a last resort to get urgently needed food and other supplies into the enclave — and for an increase in deliveries by land."], ["https://www.tiktok.com/@nytimes/video/7351070083378105642", "A majority of the Supreme Court seemed inclined on Tuesday to reject a bid to sharply limit access to abortion pills. Several justices questioned the remedy of applying nationwide restrictions to mifepristone because it would be the first time a court had second-guessed the F.D.A.’s regulatory authority."], ["https://www.tiktok.com/@nytimes/video/7350793677624741166", "Federal investigators said they were beginning what could be a long search for answers about how a massive cargo ship struck a major bridge minutes after leaving the Port of Baltimore early Tuesday. The ship’s crew issued a warning that it had lost power, giving officials a brief chance to stop cars and try to evacuate the span before it fell into the river."], ["https://www.tiktok.com/@nytimes/video/7350730018387070254", "Dozens of states have lured film and TV production with financial incentives. But economists have long been dubious about the value of subsidies for film and television, saying they have plunged state governments into a race to the bottom where the biggest winner, by far, is Hollywood."], ["https://www.tiktok.com/@nytimes/video/7350683178316614954", "A major bridge in Baltimore collapsed after being struck by a cargo ship early Tuesday, sending vehicles plunging into the water and setting off an emergency response, the Coast Guard and the local authorities said. Baltimore’s fire chief, James Wallace, said at a news conference that officials were searching for “upwards of seven people” and that two others had been pulled from the water. One of them was in serious condition."], ["https://www.tiktok.com/@nytimes/video/7350439183426538795", "Security camera footage obtained by The New York Times shows that Brazil’s former president, Jair Bolsonaro, spent two nights at the Hungarian Embassy in an apparent bid for asylum. The stay at the embassy suggests that the former president was seeking to evade the Brazilian justice system as he faces criminal investigations at home."], ["https://www.tiktok.com/@nytimes/video/7349936959500094766", "From Child Marriage to Hysterectomy, Women Give Their Lives to Sugar"], ["https://www.tiktok.com/@nytimes/video/7349641492761185579", "Kremlin Says All 4 Concert Hall Attackers Are in Custody as Death Toll Rises to 133"], ["https://www.tiktok.com/@nytimes/video/7349303260244725035", "In his third presidential race, Donald J. Trump is continuing a theme from previous election cycles: using violent rhetoric on the campaign trail."], ["https://www.tiktok.com/@nytimes/video/7349274168447339819", "Princess of Wales Announces Cancer Diagnosis"], ["https://www.tiktok.com/@nytimes/video/7349247844861136170", "As the U.S. debates a plan that could block TikTok, content creator Ulhas Kamathe explains how he lost everything when it happened in India. Here’s how he rebuilt his career."], ["https://www.tiktok.com/@nytimes/video/7349218142909975851", "On April 8, North America will experience its second total solar eclipse in seven years. The moon will glide over the surface of our sun, casting a shadow over a swath of Earth below. Along this path, the world will turn dark as night. These are answers to common questions about the April 8 eclipse."], ["https://www.tiktok.com/@nytimes/video/7348935855744060714", "Vaughan Gething on Thursday became the first Black person to lead a national government in Europe, a day after he was elected the first minister of Wales."], ["https://www.tiktok.com/@nytimes/video/7348888498662821163", "As President Biden and Donald Trump enter a new phase of the presidential race, Maggie Haberman takes a look at the different challenges they face compared to four years ago."], ["https://www.tiktok.com/@nytimes/video/7348835607382215978", "Zolan Kanno-Youngs, a White House correspondent for The New York Times, traveled with President Biden to Nevada, where he tried to gain support from Hispanic voters."], ["https://www.tiktok.com/@nytimes/video/7348542367097736494", "Arizona has emerged as a crucial abortion rights battleground following the Supreme Court's decision to overturn Roe v. Wade. This week, one Democratic state senator, Eva Burch, put the debate in searingly personal terms during a speech on the floor on Monday, detailing the barriers she faced when she tried to get an abortion for a recent pregnancy that she learned had no chance of survival."], ["https://www.tiktok.com/@nytimes/video/7348181867830463775", "Three editors of The New York Times Book Review recommend the books they think should be next on your list. For more recommendations, check out the “Let Us Help You Find Your Next Book” page at the link in our bio."], ["https://www.tiktok.com/@nytimes/video/7348100964966124846", "Giving to hospitals in places where someone might have a second or fifth house is a favored cause of the rich. A single summer party on Long Island might raise millions of dollars for Southampton Hospital."], ["https://www.tiktok.com/@nytimes/video/7347718258755145002", "When a seagrass shortage caused a mass manatee die-off, scientists rushed to save the orphaned young. After three years at a zoo, the manatees are now grown up and going back to the wild."], ["https://www.tiktok.com/@nytimes/video/7346699076387245343", "At least three people were killed and dozens were injured after severe weather that set off tornadoes blew through parts of Indiana, Kentucky and Ohio overnight, officials said."], ["https://www.tiktok.com/@nytimes/video/7346623995791396139", "Senator Chuck Schumer, Democrat of New York and the majority leader, delivered a pointed speech on the Senate floor on Thursday excoriating Prime Minister Benjamin Netanyahu of Israel as a major obstacle to peace in the Middle East and calling for new leadership in Israel, five months into the war."], ["https://www.tiktok.com/@nytimes/video/7346600391359925546", "The quiet withdrawal of a 2021 cancer study by Dr. Sam Yoon highlights scientific publishers’ lack of transparency around data problems."], ["https://www.tiktok.com/@nytimes/video/7346323698271489322", ""], ["https://www.tiktok.com/@nytimes/video/7346313852562328875", "Paul Alexander was paralyzed with polio at age 6 and relied on the machine to breathe. Still, he earned a law degree, wrote a book and, late in life, built a following on TikTok."], ["https://www.tiktok.com/@nytimes/video/7346235840684772654", "For 40 years, contestants on “Wheel of Fortune,” the TV game show staple, have hoped to reach the final puzzle, called the bonus round. A correct guess can mean a new car, $40,000 or even $1 million."], ["https://www.tiktok.com/@nytimes/video/7345971603941100846", "The House on Wednesday passed a bill with broad bipartisan support that would force TikTok’s Chinese owner, ByteDance, to either sell the hugely popular video app or have it banned in the U.S."], ["https://www.tiktok.com/@nytimes/video/7345926346469690667", "In a new essay, Nikole Hannah-Jones argues that the fall of affirmative action is part of a 50-year campaign to roll back racial progress."], ["https://www.tiktok.com/@nytimes/video/7345561709081480494", "New York City officials are investigating a confrontation at a city-run shelter in Queens where police officers struck and used a stun gun on a Venezuelan migrant while he was holding his 1-year-old son."], ["https://www.tiktok.com/@nytimes/video/7345132032768347434", "The war and hunger in Gaza have cast a somber tone over this year’s holy month of Ramadan as people struggle to find affordable essentials to celebrate."], ["https://www.tiktok.com/@nytimes/video/7345114770988617003", "After making billions in tax-deductible donations to his philanthropy, Elon Musk gave away far less than required in some years — and what he did give often supported his own interests."], ["https://www.tiktok.com/@nytimes/video/7345082136946576686", "Fittingly for an Academy Awards celebrating 2023, the year of “Barbenheimer,” the movies that made up that phenomenon commanded our attention on Sunday night, too. The biopic “Oppenheimer” was showered with honors, and the race for best actress culminated in a second Oscar for Emma Stone. The Israel-Hamas war was prominently addressed by director Jonathan Glazer in an acceptance speech for “The Zone of Interest,” which follows the domestic life of a Nazi commandant whose house is just outside the Auschwitz concentration camp."], ["https://www.tiktok.com/@nytimes/video/7344941777129852203", "Some Oscar attendees were delayed as they made their way to the Dolby Theater on Sunday as demonstrators calling for a cease-fire in Gaza filled lanes of traffic a few blocks south of the theater, according to the Los Angeles Police Department."], ["https://www.tiktok.com/@nytimes/video/7344798927482391850", "The director Jonathan Glazer narrates a sequence from his Holocaust drama, in ‘The Zone of Interest,’ which is nominated for five Academy Awards, including best picture. This scene observes a weekday at the home of Rudolf Höss, the commandant of the concentration camp Auschwitz. This is a special “Oscars 2023” episode of Anatomy of a Scene, a long-running New York Times video series in which film directors reveal the secrets of making movies."], ["https://www.tiktok.com/@nytimes/video/7344487660070718762", "The director Alexander Payne narrates a scene from his film ‘The Holdovers,’ which received 5 academy award nominations including best picture. In this comedy set in 1970 during the holiday break at an all-boys boarding school one student, Angus Tully (played by Dominic Sessa) must stay on campus during the break, and a teacher, Paul Hunham (Paul Giamatti) is tasked with watching him. This is a special “Oscars 2023” episode of Anatomy of a Scene, a long-running New York Times video series in which film directors reveal the secrets of making movies."], ["https://www.tiktok.com/@nytimes/video/7344134170781830443", "Higher prices? Fewer places? As several states consider lifting wages for tipped workers, here’s how the shift is already playing out in the nation’s capital."], ["https://www.tiktok.com/@nytimes/video/7344109451219143982", "The writer and director Christopher Nolan narrates a sequence from his film, ‘Oppenheimer, nominated for 13 Academy Awards including best picture. This is a special “Oscars 2023” episode of Anatomy of a Scene, a long-running New York Times video series in which film directors reveal the secrets of making movies."], ["https://www.tiktok.com/@nytimes/video/7343871428606823722", ""], ["https://www.tiktok.com/@nytimes/video/7343755134242983210", "Greta Gerwig, the co-writer and director of “Barbie,” narrates this musical sequence of Ryan Gosling’s performance of the song “I’m Just Ken.” The film received 8 academy award nominations including best picture. This is a special “Oscars 2023” episode of Anatomy of a Scene, a long-running New York Times video series in which film directors reveal the secrets of making movies."], ["https://www.tiktok.com/@nytimes/video/7343725839260945706", "In war-torn Gaza, Waem Al-Farra is expecting her first child, but for her the joys of pregnancy have been replaced with fear and concern for her future and the life of her unborn child."], ["https://www.tiktok.com/@nytimes/video/7343700075861888299", "The director Martin Scorsese narrates a sequence from his film “Killers of the Flower Moon,” which is nominated for 11 Academy Awards including best picture. A three-and-a-half-hour epic starring Leonardo DiCaprio, it’s a romance, a western, a whodunit and a lesson in the bloody history of the Osage murders of the 1920s. This is an episode of Anatomy of a Scene, a long-running New York Times video series in which film directors reveal the secrets of making movies."], ["https://www.tiktok.com/@nytimes/video/7343660030765387051", "In the middle of struggling through the opening monologue of the Golden Globes this year, the comic Jo Koy did something unusual for the host of a major awards show: He blamed his writers."], ["https://www.tiktok.com/@nytimes/video/7343644814014991662", "The writer and director Celine Song narrates a sequence from her debut film, “Past Lives,” which is nominated for best picture at the Oscars. The film, starring Greta Lee and Teo Yoo, follows two childhood friends who share a wistful kind of love across two decades and two continents. This is a special “Oscars 2023” episode of Anatomy of a Scene, a long-running New York Times video series in which film directors reveal the secrets of making movies."], ["https://www.tiktok.com/@nytimes/video/7343289358247824686", ""], ["https://www.tiktok.com/@nytimes/video/7342953111641754922", ""], ["https://www.tiktok.com/@nytimes/video/7342658643331960095", "French legislators on Monday voted to explicitly enshrine access to abortion in the Constitution, making their country the first in the world to do so."], ["https://www.tiktok.com/@nytimes/video/7342612520894467359", "Footage released by the Albert Einstein College of Medicine shows Dr. Ruth Gottesman announcing that the school will be tuition-free after she made a $1 billion gift"], ["https://www.tiktok.com/@nytimes/video/7341514229318552875", ""], ["https://www.tiktok.com/@nytimes/video/7341192220659158314", "Israeli forces opened fire while a crowd was gathered on Thursday near a convoy of trucks carrying desperately needed aid to Gaza City, according to Gazan health officials and the Israeli military, resulting in a chaotic scene in which scores of people were killed and injured."], ["https://www.tiktok.com/@nytimes/video/7341167973647961390", "President Biden and former President Donald Trump took dueling trips to the southern border on Thursday, creating a stark split screen as each sought a political advantage on a dominant issue of the 2024 presidential campaign."], ["https://www.tiktok.com/@nytimes/video/7341079740540865838", "President Biden and Donald Trump are making dueling trips to South Texas at a time when Americans are citing immigration as one of their top concerns."], ["https://www.tiktok.com/@nytimes/video/7341063633226501419", "The Oscars are coming up, and several of the nominated films are based on books. Gilbert Cruz, editor of The New York Times Book Review, recommends a few of them."], ["https://www.tiktok.com/@nytimes/video/7340756060900265262", ""], ["https://www.tiktok.com/@nytimes/video/7340728540691762475", "Wildfires were spreading rapidly in Texas and Oklahoma early Wednesday, prompting evacuations and the closure of a plant that disassembles nuclear weapons."], ["https://www.tiktok.com/@nytimes/video/7339895159435365674", "Final Fantasy VII, one of the most consequential games in history, is being remade by its creators. Cloud, Sephiroth and Aerith are set to continue their adventures in the soon-to-be-released second installment, Rebirth."], ["https://www.tiktok.com/@nytimes/video/7338904126970973486", "Seeking social media stardom for their underage daughters, mothers post images of them on Instagram. Although the site prohibits children under 13, parents can open so-called mom-run accounts for them, and they can live on even when the girls become teenagers."], ["https://www.tiktok.com/@nytimes/video/7338870873438391594", "Donald Trump is expected to win easily in Saturday’s Republican primary in Nikki Haley’s home state of South Carolina."], ["https://www.tiktok.com/@nytimes/video/7338850046349446446", "For those who remember the Williamsburg of long ago, or of even a decade ago, walking its streets can be disorienting. The Brooklyn neighborhood once characterized by factory buildings, vacant lots and streets lined with warehouses is now filled with glossy apartment towers, boutique hotels and upscale retailers."], ["https://www.tiktok.com/@nytimes/video/7338183381110344990", "Thirty years ago, the U.S. entered an era of productivity gains that enabled healthy growth. Experts are asking if it could happen again."], ["https://www.tiktok.com/@nytimes/video/7338137249642581294", "The United States urged the International Court of Justice not to call for immediate withdrawal of Israel from Palestinian territories, and to consider the country’s security needs."], ["https://www.tiktok.com/@nytimes/video/7338099838820617514", "With the Oscars around the corner, The New York Times Magazine and Wesley Morris, a Times critic, have created a list of distinctly unusual acting performances from the past year."], ["https://www.tiktok.com/@nytimes/video/7338062661931846943", "Pakistanis once thought of the military as the iron hand controlling the country’s politics. That illusion has been broken, creating one of the establishment’s biggest crises yet."], ["https://www.tiktok.com/@nytimes/video/7337814531567308078", "Since 2019, Julian Assange, the founder of WikiLeaks, has been held in a high-security prison in southeast London while his lawyers fight a U.S. extradition order. Now, that particular battle may be nearing its end."], ["https://www.tiktok.com/@nytimes/video/7337781871473872170", "The United States on Tuesday vetoed a United Nations Security Council resolution put forth by Algeria that would have called for an immediate cease-fire in Gaza. It was the third time Washington had blocked a resolution that would have demanded an immediate end to fighting."], ["https://www.tiktok.com/@nytimes/video/7337769502916054303", "When war broke out in Gaza on Oct.7, Motaz Azaiza, a Palestinian photographer, turned his camera to covering pain and loss in a territory under siege. In doing so, he attracted millions of followers — documenting the war while also trying to survive it."], ["https://www.tiktok.com/@nytimes/video/7337741247789927723", "South Africa said Tuesday that Israel’s policies toward Palestinians were “a more extreme form of apartheid,” invoking its own charged history of racial discrimination to add to global pressure on Israel at the International Court of Justice in The Hague."], ["https://www.tiktok.com/@nytimes/video/7336722204500954411", ""], ["https://www.tiktok.com/@nytimes/video/7336695486071557418", "Police in Russia Detain Mourners at Navalny Memorials"], ["https://www.tiktok.com/@nytimes/video/7336381207095053611", "Health care workers shared videos of a chaotic scene at Nasser Medical Complex in Khan Younis, Gaza Strip, as Israeli troops raided the hospital and ordered people to evacuate."], ["https://www.tiktok.com/@nytimes/video/7336339327624121646", "Aleksei Navalny, an anticorruption activist who for more than a decade led the political opposition in President Vladimir Putin’s Russia while enduring arrests, assaults and a near-fatal poisoning, died Friday in a Russian prison. He was 47."], ["https://www.tiktok.com/@nytimes/video/7336291283020909867", "President Biden blamed President Vladimir Putin of Russia for the reported death of the imprisoned opposition leader Aleksei Navalny. Though he acknowledged the U.S. did not have a full understanding of the circumstances, Biden said to “make no mistake” about Putin’s involvement."], ["https://www.tiktok.com/@nytimes/video/7336257344927583534", "Just hours after Aleksei Navalny, the anticorruption campaigner, was reported dead, his wife, Yulia Navalnaya, made a dramatic, surprise appearance at a gathering of world leaders in Munich on Friday. Taking the stage, she denounced President Vladimir Putin of Russia and vowed that he and his circle “will be brought to justice.”"], ["https://www.tiktok.com/@nytimes/video/7336221820728724779", "Greece legalized same-sex marriage and equal parental rights for same-sex couples on Thursday as lawmakers passed a bill that has divided Greek society and drawn vehement opposition from the country’s powerful Orthodox Church."], ["https://www.tiktok.com/@nytimes/video/7335602273890028846", "A celebration of the Kansas City football team’s Super Bowl victory was marred when several people were shot near the city’s Union Station on Wednesday afternoon, killing at least one, the police said. The shooting led to a scene of chaos as thousands of fans in red jerseys fled the rally."], ["https://www.tiktok.com/@nytimes/video/7335544987423378734", "Israel’s military campaign in Gaza, now in its fourth month, is often described in terms of stark numbers and historical comparisons: Some 27,000 Palestinians have been killed, according to the Gaza health ministry. Nearly two million people are displaced and more than 60 percent of residential buildings have been damaged or destroyed."], ["https://www.tiktok.com/@nytimes/video/7335519009879625006", "Gen Z and millennials make up 52 percent of the registered voters in Indonesia. Here’s how the three presidential candidates wooed young voters, including with a viral TikTok dance and K-pop themed events."], ["https://www.tiktok.com/@nytimes/video/7335214341790141742", "President Biden condemned former President Donald J. Trump for encouraging Russia to attack NATO members and said that a $95 billion spending package was imperative for Ukraine to fight Russia."], ["https://www.tiktok.com/@nytimes/video/7335138394839764270", "A nor’easter dumping heavy snow on the country’s most populated region is disrupting daily life in New York and beyond, with officials urging millions of people to avoid traveling in a storm that could produce two inches of snow an hour or more in some areas. More than 30 million people were under a winter storm warning, according to the National Weather Service."], ["https://www.tiktok.com/@nytimes/video/7335134654606871838", "At the start of one of Brazil’s most famous Carnival celebrations, the town of Olinda was jammed with thousands of revelers. They were all awaiting the arrival of their idol: a 12-foot puppet of John Travolta. Celebrating its 45th birthday this year, the “boneco,” as such giant puppets are known in Brazil, is about as old as the film that inspired its creation: “Saturday Night Fever.” The John Travolta boneco is one of hundreds of giant puppets that parade through Olinda for four days every February, becoming the calling card of this city’s renowned Carnival and a show of how the pre-Lent festivities in Brazil are far more than just Rio de Janeiro’s extravagant Samba parade."], ["https://www.tiktok.com/@nytimes/video/7334889628366916906", "Eleven-year-old Dareen al-Bayaa lost dozens of her family members in a single airstrike in Gaza. She is one of at least 17,000 children across the territory who have been orphaned or separated from their parents."], ["https://www.tiktok.com/@nytimes/video/7334852427641916715", "As the Arlington, a Canadian ship carrying a load of wheat, started to sink in stormy weather in Lake Superior on May 1, 1940, its crew clambered into a lifeboat and then watched a strange sight from a nearby vessel that rescued them."], ["https://www.tiktok.com/@nytimes/video/7333735638497365290", "Roughly 1.4 million Palestinians are sheltering in Rafah in southern Gaza, including many who have been displaced multiple times since the start of the war. Benjamin Netanyahu, Israel's prime minister, has ordered the military to come up with a plan for civilians sheltering in Rafah to evacuate, as Israeli leaders have increasingly indicated they intend to send ground troops into the city."], ["https://www.tiktok.com/@nytimes/video/7333735428538961198", "At least two people were killed when a small plane crashed on Interstate 75 near Naples, Fla., on Friday afternoon, according to the Federal Aviation Administration."], ["https://www.tiktok.com/@nytimes/video/7333679395619491103", "Chicken over rice costs $10 at the Halal Plates, a cart in Lower Manhattan, up from $6 prepandemic. The owners pay $22.50 for a 10-pound bag of chicken, almost twice the cost four years ago. But the biggest factor? An $18,000 black-market permit trade."], ["https://www.tiktok.com/@nytimes/video/7333622891583687982", "Ceylan Yeğinsu, a Travel reporter for The Times, joined thousands of passengers on the inaugural sailing of Royal Caribbean’s Icon of the Seas, the world’s largest cruise ship. Yes, the water rides were wild. But the most surprising thing she found? Some actual peace and quiet."], ["https://www.tiktok.com/@nytimes/video/7333440925835873579", "In fiery remarks, President Biden hit back against a special counsel’s report that found he had mishandled classified files, stressing that he did not have memory problems. Biden spoke from the White House on Thursday just hours after the special counsel had cleared him in the documents case but said he had a “poor memory.”"], ["https://www.tiktok.com/@nytimes/video/7333314004795821354", "The New York Times photographer Simbarashe Cha explores what it took to put together the Marc Jacobs fashion show."], ["https://www.tiktok.com/@nytimes/video/7332897127032556842", ""], ["https://www.tiktok.com/@nytimes/video/7332893736277527838", "Our personal tech columnist tries Apple’s new Vision Pro and is less than impressed."], ["https://www.tiktok.com/@nytimes/video/7332565268499025195", "More than 1,000 Black faith leaders are pressuring the Biden administration to push for a cease-fire in Israel’s war on Hamas in Gaza."], ["https://www.tiktok.com/@nytimes/video/7332159317912636715", "We gathered 121 menus from restaurants all over the U.S. Together, they offer a glimpse into American tastes and values of today. Tap the link in our bio to read the full story."], ["https://www.tiktok.com/@nytimes/video/7332157662064495918", "A record-breaking California storm forced dozens of emergency rescues and knocked out power for hundreds of thousands of residents. The system was expected to stall over the Los Angeles area and create more flooding on Monday."], ["https://www.tiktok.com/@nytimes/video/7331750869811219755", "In the year since earthquakes devastated southern Turkey, the Karapirli family has struggled to heal, find a home and cope with a bottomless sense of loss. For Ibrahim, 47, Pinar, 35, and their 2½-year-old twins, Elcin and Eray, the year since the Feb. 6 earthquake has been a painful quest to cobble together a new life, piece by piece, trauma by trauma."], ["https://www.tiktok.com/@nytimes/video/7331139162948652330", "The damage caused by Israel’s aerial offensive in Gaza has been well documented. But Israeli ground forces have also carried out a wave of controlled explosions that has drastically changed the landscape in recent months."], ["https://www.tiktok.com/@nytimes/video/7331066116309159214", "Jonathan Weisman, a political correspondent for The New York Times, explains the right-wing conspiracy theories about Taylor Swift, Travis Kelce and the Super Bowl."], ["https://www.tiktok.com/@nytimes/video/7331040001125322014", "The origins of Black History Month can be traced back nearly a hundred years to an unassuming, three-story brick rowhouse in Washington that used to be owned by Carter G. Woodson."], ["https://www.tiktok.com/@nytimes/video/7330342427536117038", "During a tense Senate hearing with executives from TikTok, X, Snap and Discord, the Meta chief executive Mark Zuckerberg stood up from the witness table and turned to directly address parents in the room whose children had been victims of online harassment and exploitation. Zuckerberg said that he was “sorry for everything that you all have gone through.”"], ["https://www.tiktok.com/@nytimes/video/7329988335693319466", "The Palestinian Authority Health Ministry released surveillance video that shows armed Israeli forces dressed in civilian clothes inside a hospital in the northern West Bank city of Jenin."], ["https://www.tiktok.com/@nytimes/video/7329957767131745582", "A Japanese macaque was spotted in a man’s backyard after it escaped from Highland Wildlife Park in Scotland on Sunday. Park officials have brought in thermal drones to help them search for the animal and have asked residents to report sightings."], ["https://www.tiktok.com/@nytimes/video/7329617681575922986", "Dr. Ahmed Moghrabi, a surgeon, described days of “horror” at Nasser Hospital, one of the last hospitals still providing medical care in Gaza. Dr. Moghrabi, who has worked at the hospital complex for three years, shared footage with The New York Times that he filmed last week."], ["https://www.tiktok.com/@nytimes/video/7328557005113740586", "The United Nations’ highest court said on Friday that Israel must take action to prevent acts of genocide by its forces in Gaza and must let more aid into the enclave. But the court did not call on Israel to immediately suspend its military campaign."], ["https://www.tiktok.com/@nytimes/video/7328444782831799583", "Though “Oppenheimer” made an explosive showing when the Oscar nominations were announced on Tuesday morning, plenty of other would-be contenders failed to launch. Here is our analysis of the biggest surprises and omissions."], ["https://www.tiktok.com/@nytimes/video/7327794131848154398", "A surge of unexpected waves swamped Roi-Namur in the Marshall Islands on Saturday, forcing evacuations from a U.S. military base and causing damage that could take months to repair."], ["https://www.tiktok.com/@nytimes/video/7327722713135516959", "The door plug that blew off an Alaska Airlines plane most likely had manufacturing or installation flaws. A New York Times analysis of how the door plug is supposed to work, a review of photos and documents, and interviews with aviation experts suggest that manufacturing or installation problems allowed it to come loose and break away just two months after Boeing delivered the 737 Max 9 to Alaska Airlines."], ["https://www.tiktok.com/@nytimes/video/7327718019881241886", "The border between Israel and Lebanon has become a landscape of abandoned towns and neglected farms as escalating tensions and tit-for-tat strikes between Israeli forces and Hezbollah militants have displaced more than 150,000 people in both countries."], ["https://www.tiktok.com/@nytimes/video/7327559698914364718", ""], ["https://www.tiktok.com/@nytimes/video/7327502974392044843", ""], ["https://www.tiktok.com/@nytimes/video/7327327581265513758", "For Peter Whelan, a lifelong conservative and fisherman in New Hampshire, politics is all about responding to the threats climate change poses to the fishing industry. “The hard-core conservatives and climate deniers are people that aren’t on the water every day and seeing it,” Whelan said. With warming waters significantly affecting his livelihood, Whelan wants Republicans to overcome their skepticism about climate change and offer a united path forward."], ["https://www.tiktok.com/@nytimes/video/7327298890200288554", ""], ["https://www.tiktok.com/@nytimes/video/7327026608424881450", "Supporters and relatives of hostages captured in the Oct. 7 Hamas-led attacks burst into a meeting at Israel’s Parliament on Monday to demand that lawmakers take greater action to secure the captives’ release from Gaza."], ["https://www.tiktok.com/@nytimes/video/7326998126147996959", "Prime Minister Narendra Modi of India inaugurated a gigantic new temple in the Indian city of Ayodhya on Jan. 22. It was the conclusion of a long campaign in which Hindu nationalists tore down a centuries-old mosque and replaced it with a structure devoted to the Hindu deity Ram. The moment is one of triumph for Hindu nationalists, but for the 200 million Muslims in India, the Ram temple has reinforced a sense of despair and dislocation."], ["https://www.tiktok.com/@nytimes/video/7326993557527579935", "The National Association of Realtors is the largest professional organization in the U.S. For more than a century, it has wielded immense power over the nation’s housing industry. To gain access to nearly all U.S. home listings and to call themselves Realtors, its 1.5 million members each pay hundreds of dollars in annual dues. But after months of turmoil — N.A.R. is facing antitrust lawsuits and sexual harassment allegations — real estate agents are looking for alternatives."], ["https://www.tiktok.com/@nytimes/video/7326665266610359598", "Ron DeSantis has dropped out of the presidential race. DeSantis’s distant loss to Donald J. Trump in Iowa dealt a devastating blow to his campaign. His exit caps a spectacular political failure and leaves Mr. Trump and Nikki Haley locked in a two-person contest."], ["https://www.tiktok.com/@nytimes/video/7326303211998989610", "Nikki Haley on Saturday escalated her attacks on Donald Trump, criticizing his mental acuity for the first time — a day after the former president appeared to confuse her for Nancy Pelosi, the former House speaker, during his Friday night rally in New Hampshire."], ["https://www.tiktok.com/@nytimes/video/7325871791723810091", "Recent satellite imagery shows an influx of displaced Palestinians into Rafah, the Gaza Strip’s southernmost region, where about 1.25 million people are now living in squalid, cramped conditions."], ["https://www.tiktok.com/@nytimes/video/7325859473627565342", "A Boeing cargo plane headed for Puerto Rico was diverted back to Miami International Airport shortly after takeoff when an engine failed, according to the Federal Aviation Administration. The episode is another potential setback for Boeing, which has been thrust into the spotlight in recent weeks over quality control concerns. Video taken from the ground appeared to show flames repeatedly shooting from the plane as it flew."], ["https://www.tiktok.com/@nytimes/video/7325585241387601194", "Niki Frenchko, a Trumbull County commissioner, was arrested at a public meeting in July 2022 after a dispute in which she criticized the county sheriff."], ["https://www.tiktok.com/@nytimes/video/7324628184643816746", "Former President Donald Trump won the Iowa caucuses, while Ron DeSantis took second and Nikki Haley came in third. Lisa Lerer, a national political correspondent for The New York Times, explains the results."], ["https://www.tiktok.com/@nytimes/video/7324341890894122283", "Former President Donald Trump leads the other candidates by a wide margin in the latest polls. Jonathan Weisman, a Times correspondent, explains how Nikki Haley and Ron DeSantis are competing for second place."], ["https://www.tiktok.com/@nytimes/video/7324080479777492270", "A volcano in Iceland erupted on Sunday after hundreds of earthquakes shook the Reykjanes Peninsula, reaching the evacuated town of Grindavik."], ["https://www.tiktok.com/@nytimes/video/7323985656072555822", "The Iowa caucuses on Monday, Jan. 15, will be the first time that Republican voters get to decide between the candidates in the field. Astead Herndon, host of the New York Times podcast “The Run-Up,” explains how the caucuses work and what the stakes may be."], ["https://www.tiktok.com/@nytimes/video/7323660643045756202", "In footage published by Taiwan’s Democratic Progressive Party, Lai Ching-te, the island’s president-elect, called for Taiwanese citizens to come together and pledged to uphold Taiwan’s values."], ["https://www.tiktok.com/@nytimes/video/7323336414635003179", "Israel, which was founded in the aftermath of a genocide against the Jewish people, defended itself on Friday against accusations of perpetrating genocide against the Palestinians in Gaza."], ["https://www.tiktok.com/@nytimes/video/7323249238421359902", "Iranian-backed Houthi forces and their allies on Friday condemned American-led military strikes in Yemen and vowed to respond, as the Middle East went on alert for retaliatory attacks that could expand the conflict in the region. The American-led strikes came in response to more than two dozen Houthi drone and missile attacks against commercial shipping in the Red Sea since the Israel-Hamas war began."], ["https://www.tiktok.com/@nytimes/video/7323229503222893870", "As much as it was a show about Italian American mobsters, “The Sopranos” was a show about New Jersey. We revisit some of its iconic settings and look at why they were chosen. Tap the link in our bio to read the full story."], ["https://www.tiktok.com/@nytimes/video/7322925919872617770", "South Africa made its case on Thursday before the United Nations’ highest judicial body that Israel was acting with “genocidal intent” in Gaza."], ["https://www.tiktok.com/@nytimes/video/7322621192727268650", "Chris Christie, the former governor of New Jersey who made a taunting but futile effort to pry Republican voters from Donald Trump’s grip, bowed on Wednesday to mounting pressure from within his party and suspended his presidential campaign."], ["https://www.tiktok.com/@nytimes/video/7322593282201193774", "Annie Karni, a New York Times politics reporter, reflects on Congress’s lack of productivity in 2023, and what that could mean for the 2024 session."], ["https://www.tiktok.com/@nytimes/video/7322590805518978347", "For the first time in St. Paul, Minn., all seven City Council members are women. They also make up the youngest and most racially diverse council in the city’s history."], ["https://www.tiktok.com/@nytimes/video/7322550102646705450", "A ceremonial spot near a heavily secured courtroom is one of the few places in the Guantanamo Bay complex — whose inmates include five men accused of plotting the Sept. 11 attacks — that the U.S. government allows visitors to see. Take a look inside the detention and court operations with Carol Rosenberg, the New York Times Guantanamo Bay correspondent."], ["https://www.tiktok.com/@nytimes/video/7322525126992383274", "Gunmen in masks stormed a television station in Ecuador’s largest city on Tuesday, taking anchors and staff members hostage and exchanging gunfire with the police before the intruders were subdued and arrested."], ["https://www.tiktok.com/@nytimes/video/7322234032845032747", "Heavy rains are pelting parts of the East Coast, while blizzard conditions sweep the Pacific Northwest and tornadoes strike the South. At least two deaths were blamed on the weather. Authorities in New York and the surrounding area are warning residents to prepare for treacherous weather from Tuesday afternoon into Wednesday."], ["https://www.tiktok.com/@nytimes/video/7322131079043829035", "Each January, The New York Times’s Travel desk publishes its list of 52 Places to Go. This year’s list includes something for everyone — from remote villages to pristine waters to science centers to a region celebrating 150 years of Impressionism. Tap the link in our bio to see the full list of 52 Places to Go in 2024."], ["https://www.tiktok.com/@nytimes/video/7321772864183553310", "For months, a mysterious helper was cleaning up the work bench in Rodney Holbrook’s shed every night. He caught the visitor, tail and all, on video."], ["https://www.tiktok.com/@nytimes/video/7321766292925451563", "A brand-new rocket lifted off early Monday morning from Cape Canaveral, Fla., and sent a robotic spacecraft toward the surface of the moon. No American spacecraft has made a soft landing on the moon since 1972."], ["https://www.tiktok.com/@nytimes/video/7321071464051100974", "Alaska Airlines Plane Makes Emergency Landing After Losing Piece of Its Body"], ["https://www.tiktok.com/@nytimes/video/7321006696250314026", "Nearly three years after a mob attacked the Capitol on Jan. 6, 2021, in support of former President Donald Trump, the criminal investigation into the events of that day pushes on. Prosecutors have called the riot inquiry the largest in the history of the Justice Department, and there is no doubt it is vast by any measure."], ["https://www.tiktok.com/@nytimes/video/7320735208452705582", "President Biden on Friday delivered a ferocious condemnation of Donald Trump, his likely 2024 opponent, warning in searing language that the former president had directed an insurrection and will aim to undo the nation’s bedrock democracy if he returns to power."], ["https://www.tiktok.com/@nytimes/video/7320661526384364846", "Young Voters Are Voicing Discontent: ‘I Don’t Want a Biden-Trump Rematch’"], ["https://www.tiktok.com/@nytimes/video/7320632000795151658", "Can doppelgängers of Vincent van Gogh help museums generate new interest and income? An A.I. of the Dutch painter fields our questions (and makes some mistakes)."], ["https://www.tiktok.com/@nytimes/video/7320265249817365802", "On Dec. 21, Willis Gibson, 13, put his hands to his head and rocked back and forth in an office chair in his bedroom in Stillwater, Okla., unable to believe what he had just accomplished."], ["https://www.tiktok.com/@nytimes/video/7320056857182080302", "A pair of explosions on Wednesday at a memorial for Iran’s former top general, Qassim Suleimani, killed at least 103 people and wounded an additional 211, according to Iranian officials. The attack sowed fear in a country where domestic unrest and the prospect of a spiraling regional war have left many on edge."], ["https://www.tiktok.com/@nytimes/video/7320001060725378350", "Video shot by passengers on Japan Airlines Flight 516, which collided with a Coast Guard plane on Tuesday, shows smoke filling the cabin before passengers and crew members evacuate the burning plane."], ["https://www.tiktok.com/@nytimes/video/7319908822129151262", "After months of war and fleeing from one place to the next with his family, Mosab Abu Toha, a Palestinian poet, crossed into Egypt. He describes his experience, including being stripped, beaten and detained by Israeli soldiers."], ["https://www.tiktok.com/@nytimes/video/7319898872984194347", "Throughout her presidential campaign, Nikki Haley has sought to tread a fine line in talking about her gender. She emphasizes elements of her life and career that inherently set her apart in an otherwise all-male field, but avoids leaning into her identity in ways that might repel the largely white and graying base of conservative voters she needs to court in order to win the nomination."], ["https://www.tiktok.com/@nytimes/video/7319889414442732843", "Do you want to have more energy as you go about your day? The answer is probably yes. Tap the link in our bio to read more about energy for a more invigorating 2024."]]