[["https://www.tiktok.com/@washingtonpost/video/7340769465354751263", "Wendy’s will soon spend $20 million on digital menu boards that will allow stores have a more flexible menu, but the fast food chain will not be using Uber-style surge pricing."], ["https://www.tiktok.com/@washingtonpost/video/7325204380888681770", "A federal judge on blocked JetBlue Airways’ effort to merge with Spirit Airlines. In his 113-page decision, U.S. District Judge William G. Young wrote that a merger would hurt consumers who rely on Spirit’s low fares. "], ["https://www.tiktok.com/@washingtonpost/video/7325573724437040426", "Pelase weclome Joseph to the team!"], ["https://www.tiktok.com/@washingtonpost/video/7358477279602707755", "No jurors have been selected yet in former president Donald Trump’s hush money trial in New York."], ["https://www.tiktok.com/@washingtonpost/video/7358203794800528686", "Internet services have ‘nutrition labels’ now"], ["https://www.tiktok.com/@washingtonpost/video/7358171628548689198", "Iran launched its much-anticipated attack on Israel on Saturday. More than 100 ballistic missiles were fired, senior U.S. officials said, complemented by about 30 cruise missiles and more than 150 explosive drones. Israeli and U.S. officials said that 99 percent of the incoming munitions were intercepted, suggesting just a few may have struck their intended targets."], ["https://www.tiktok.com/@washingtonpost/video/7356732653598493994", "O.J. Simpson, the football superstar who was found not guilty of murdering his ex-wife and her friend in a trial that riveted the nation and had legal and cultural repercussions for years afterward, died April 10. He was 76."], ["https://www.tiktok.com/@washingtonpost/video/7356713141318716715", "President Biden has a new plan for student relief."], ["https://www.tiktok.com/@washingtonpost/video/7356658901871283498", "Consumer Reports found concerning levels of lead when it tested store-bought Lunchables. Elevated lead levels have been linked for decades to developmental problems in children."], ["https://www.tiktok.com/@washingtonpost/video/7356360294462917934", "Arizona’s conservative Supreme Court on Tuesday revived a near-total ban on abortion, invoking an 1864 law that forbids the procedure except to save a mother’s life and punishes providers with prison time."], ["https://www.tiktok.com/@washingtonpost/video/7355674635637116206", "Dave spoke to people right after the total solar eclipse in Little Rock, Ark."], ["https://www.tiktok.com/@washingtonpost/video/7355668006816599338", "Joseph trief to hike the 2024 eclipse. Let’s see how that goes."], ["https://www.tiktok.com/@washingtonpost/video/7355631606377319722", "The Carmellas saw the 2024 eclipse from Rochester, N.Y! Well, kind of. At least Carmella had fun facts?"], ["https://www.tiktok.com/@washingtonpost/video/7355592481435684138", "Did you see it? The Washington Post Universe is here."], ["https://www.tiktok.com/@washingtonpost/video/7355511816757202218", "Some quick tips for today's solar eclipse tips."], ["https://www.tiktok.com/@washingtonpost/video/7354423155055725855", "How cloudy will the solar eclipse be? 🌤️"], ["https://www.tiktok.com/@washingtonpost/video/7354102675996200222", "What you learn about sex and race may depend on where you live. Since 2017, dozens of states have enacted more than 110 laws and policies reshaping the teaching of race, racism, sexual orientation and gender identity. These new rules now affect how three-fourths of the nation’s students learn about topics ranging from the role of slavery in American history to the lives of nonbinary people."], ["https://www.tiktok.com/@washingtonpost/video/7353763010290158894", "The largest egg producer in the United States said Tuesday that it temporarily ceased operations at one of its Texas facilities after detecting bird flu in chickens — the latest in a steady uptick of cases among U.S. farm animals in recent weeks."], ["https://www.tiktok.com/@washingtonpost/video/7353762905684184362", "Vote for us to win Webby Awards!"], ["https://www.tiktok.com/@washingtonpost/video/7353726868731858219", "Google just settled a lawsuit that could have cost them $5 billion. Instead, they will have to fundamentally change the way they collect data."], ["https://www.tiktok.com/@washingtonpost/video/7353395191136587054", "The data set was released about two weeks ago onto the dark web, which can be used for illegal activity by anonymous criminals. It may have included information such as Social Security numbers, phone numbers, email addresses, full names, dates of birth and mailing addresses, according to AT&T’s note to customers. The company said it reset the passcodes of 7.6 million current customers."], ["https://www.tiktok.com/@washingtonpost/video/7353389777674095902", "World Central Kitchen said Tuesday that it was immediately halting its operations in Gaza after seven of its workers were killed in an Israeli strike, threatening already precarious deliveries to the besieged enclave."], ["https://www.tiktok.com/@washingtonpost/video/7353022680922131755", "Meta announced earlier this month that it will stop recommending “political content” to most users on Instagram and Threads. The move, which will still allow users to see political content from people they follow, extends a policy first applied to Facebook in 2021."], ["https://www.tiktok.com/@washingtonpost/video/7352993915856784683", "Trump’s bible also includes the Constitution, the Pledge of Allegiance and, as the webpage touts, the “[h]andwritten chorus to ‘God Bless The USA’ by Lee Greenwood.” It was originally slated for release in 2021, but an outcry from a number of prominent Christians derailed the rollout."], ["https://www.tiktok.com/@washingtonpost/video/7352948707089829163", "Instagram and Threads announced they would stop proactively recommending political, alarming news and politics-focused creators and journalists gearing up for a crucial election year."], ["https://www.tiktok.com/@washingtonpost/video/7351917040178859307", "A federal judge sentenced former cryptocurrency mogul Sam Bankman-Fried to 25 years in prison, saying that a man who once graced magazine covers and testified at congressional hearings as the face of a booming new industry had in fact perpetrated one of the largest financial crimes in U.S. history."], ["https://www.tiktok.com/@washingtonpost/video/7351526258431331626", "The Washington Post Universe is here! 🌎"], ["https://www.tiktok.com/@washingtonpost/video/7351435466928885035", "The judge overseeing Donald Trump’s upcoming hush money trial in Manhattan issued a limited gag order barring the former president from discussing witnesses and other people involved in the case."], ["https://www.tiktok.com/@washingtonpost/video/7351150242819067167", "We have a big announcement tomorrow 👕🌎👀"], ["https://www.tiktok.com/@washingtonpost/video/7350765366932491562", "Nvidia is at the forefront of the AI gold rush. But how did a company that makes graphics cards get here?"], ["https://www.tiktok.com/@washingtonpost/video/7350678173253700895", "A major bridge in Baltimore collapsed after being hit by a freighter early Tuesday, sending people into the water as a large section of the bridge crashed into the Patapsco River. Baltimore Fire Chief James Wallace said several people were likely on Francis Scott Key Bridge when it fell and that vehicles have been detected in the water."], ["https://www.tiktok.com/@washingtonpost/video/7350412816672640286", "Women are getting off birth control amid an explosion of misinformation on TikTok and Instagram. Search for “birth control” on either app and a cascade of misleading videos vilifying hormonal contraception appear: Young women blaming their weight gain on the pill. Right-wing commentators claiming that some birth control can lead to infertility. Testimonials complaining of depression and anxiety."], ["https://www.tiktok.com/@washingtonpost/video/7349262588020116767", ""], ["https://www.tiktok.com/@washingtonpost/video/7349216889257725227", "The Justice Department and 16 state and district attorneys general have accused Apple of breaking federal antitrust law in a lawsuit. It alleges that the company has illegally wielded a monopoly over the smartphone market by cutting off developers and stifling competitors with punitive restrictions. The lawsuit takes aim at the iPhone, which has helped catapult Apple’s valuation to over $2.7 trillion and sell its devices to billions of users."], ["https://www.tiktok.com/@washingtonpost/video/7348951189863583007", "Trump has to pay $464 million by Monday."], ["https://www.tiktok.com/@washingtonpost/video/7347816708691807519", "Vladimir Putin claimed a landslide victory in Russia, extending his rule until 2030. "], ["https://www.tiktok.com/@washingtonpost/video/7346745182357818654", "Breaking down the 88 charges Trump faces in his four indictments. They include 44 federal charges and 44 state charges, all of them felonies."], ["https://www.tiktok.com/@washingtonpost/video/7346585759681416479", "#ad Cybersecurity used to be pretty simple. But now that hybrid connectivity and the cloud have made things more complex, stopgap security measures are so OUT. Caitlin Sarian, aka @cybersecuritygirl, lays out the trend report for"], ["https://www.tiktok.com/@washingtonpost/video/7346280436651379998", "The Republican-controlled House of Representatives overwhelmingly voted 352-65 to approve a bill requiring TikTok either be divested from ByteDance, its Beijing-based owner, or face a nationwide ban. The bill, called the Protecting Americans from Foreign Adversary Controlled Applications Act, now heads to the Senate."], ["https://www.tiktok.com/@washingtonpost/video/7345590489258724650", ""], ["https://www.tiktok.com/@washingtonpost/video/7345577104152464671", "The Taliban-run government is fostering a thriving community of YouTube influencers and video bloggers in Afghanistan, seeking to shape a positive narrative about the country by rewarding those who have welcome viewpoints with access to stories that can draw millions of views online."], ["https://www.tiktok.com/@washingtonpost/video/7345546564426878254", "Did Europe just change the internet? Starting now, six of the world’s biggest tech companies must fully comply with the Digital Markets Act, a sweeping set of E.U. rules designed to prevent them from stifling competition."], ["https://www.tiktok.com/@washingtonpost/video/7345253474210286878", "Catherine, Princess of Wales, said she altered an official photo and expressed her “apologies for any confusion” that may have been caused after it was retracted by global news agencies over concerns it had been doctored."], ["https://www.tiktok.com/@washingtonpost/video/7343994800003239198", "Facing scrutiny of his age and memory, Biden engaged in several exchanges with Republican lawmakers during Thursday’s State of the Union."], ["https://www.tiktok.com/@washingtonpost/video/7343833396348587306", "Alabama Gov. Kay Ivey (R) signed a bill to protect providers and patients doing in vitro fertilization from legal liability if embryos they create are damaged or destroyed, a move that comes weeks after a state Supreme Court ruling threatened the treatment’s use."], ["https://www.tiktok.com/@washingtonpost/video/7343761627386236190", "The TSA unveiled the country’s first self-service screening system Wednesday at Harry Reid International Airport in Las Vegas. Starting on Monday, PreCheck passengers can participate in the pilot program designed to modernize checkpoints and give travelers more autonomy."], ["https://www.tiktok.com/@washingtonpost/video/7343655479031237934", "How much would YouTube weigh if it were a newspaper?"], ["https://www.tiktok.com/@washingtonpost/video/7343389894514953502", "Donald Trump won primaries in more than a dozen states on Super Tuesday. Nikki Haley notched a victory in Vermont, but announced the end of her campaign Wednesday morning."], ["https://www.tiktok.com/@washingtonpost/video/7342959356994014506", "Deep-sea explorers searching below the waves off the coast of Chile may have found more than 100 species completely new to science. For the researchers, it shows how ocean protections put in place by the Chilean government are working to bolster biodiversity, an encouraging sign for other countries looking to safeguard their marine waters."], ["https://www.tiktok.com/@washingtonpost/video/7342909487910489374", "It’s back! #PostPeeps2024"], ["https://www.tiktok.com/@washingtonpost/video/7342171214598786347", "#ad Cybersecurity spending is up, confidence is down. What’s missing? Caitlin Sarian, aka @cybersecuritygirl, breaks down why network-embedded security from @attbusiness is the first layer of protection in a company’s defense."], ["https://www.tiktok.com/@washingtonpost/video/7341528781154159902", "Would you eat food that’s been predigested?"], ["https://www.tiktok.com/@washingtonpost/video/7341445378513882410", "Senate Minority Leader Mitch McConnell (R-Ky.) announced that he will step down from his leadership position in November. No one has officially announced a bid to replace McConnell, but a handful of lawmakers are widely seen as potential successors. Coincidentally, the three most likely successors are all named John."], ["https://www.tiktok.com/@washingtonpost/video/7341125833022590250", "With the death toll in the Gaza Strip passing 30,000 people today, many are hoping for a cease-fire before Ramadan."], ["https://www.tiktok.com/@washingtonpost/video/7341126161998843182", "How come TV's are so cheap? Tv's are nearly 90% cheaper now than they were in 2010."], ["https://www.tiktok.com/@washingtonpost/video/7340697058157907242", "Former President Trump now owes New York at least $454 million: the $355 million defamation case penalty plus interest, which is now accruing at a rate of $112,000 per day. Seperately, he faces an $83.3 million judgement in a federal defamation case brought by the writer E. Jean Carroll."], ["https://www.tiktok.com/@washingtonpost/video/7340396154800147742", "President Biden said he hopes to see a cease-fire between Israel and Hamas by Monday and that Israel has agreed to halt fighting in Gaza during the Muslim holy month of Ramadan if a hostage-release deal is reached. Israeli officials have not publicly confirmed such an agreement, and a spokesman for the prime minister’s office declined to comment. An Israeli official with knowledge of the negotiations told The Post on Tuesday, “Right now there is no deal.”"], ["https://www.tiktok.com/@washingtonpost/video/7340341481997225258", "Several exclusive Xbox games will be soon making their way to rival consoles."], ["https://www.tiktok.com/@washingtonpost/video/7340019101097594142", "AT&T says it will give affected customers $5 each to compensate for last week’s cellphone network outage that left many without service for hours."], ["https://www.tiktok.com/@washingtonpost/video/7338890757413096750", "President Biden’s administration has emailed over 150,000 student loan borrowers enrolled in the Save program to cancel their debts totaling $1.2 billion. This is the latest effort by the administration to tout its success in providing debt relief as the campaign season heats up."], ["https://www.tiktok.com/@washingtonpost/video/7338534749754985758", "People with ADHD-like traits are less likely to dwell among depleting food resources and more likely to explore other options instead — which can give them a foraging advantage in some environments, according to a recent study in the Proceedings of the Royal Society B."], ["https://www.tiktok.com/@washingtonpost/video/7338499028763610411", "A class-action lawsuit brought against the owner of Tinder, Hinge and The League says these dating apps turning us into addicts instead of helping us find love."], ["https://www.tiktok.com/@washingtonpost/video/7338218496867798315", "Boeing said Wednesday that the head of its 737 jetliner program is leaving the company in an executive shake-up weeks after a door panel blew out on a flight over Oregon, renewing questions about safety at the company."], ["https://www.tiktok.com/@washingtonpost/video/7338183981654936862", "In today’s fox’s news: James Biden testified that his brother, President Joe Biden, “never had any involvement” in the business dealings of other members of his family. He appeared for a voluntary private interview on Capitol Hill as part of House Republicans’ impeachment inquiry."], ["https://www.tiktok.com/@washingtonpost/video/7337838990017432862", "Judge Kathaleen McCormick’s no-nonsense rulings have earned the Tesla chief’s ire -— and the corporate law world’s respect."], ["https://www.tiktok.com/@washingtonpost/video/7336325408423496991", "Fani Willis, the prosecutor in Donald Trump’s election interference case in Georgia, took the stand yesterday."], ["https://www.tiktok.com/@washingtonpost/video/7336255255295855915", "Russia, China and other U.S. adversaries are using the newest wave of artificial intelligence tools to improve their hacking abilities, according to a report from Microsoft and its close business partner OpenAI."], ["https://www.tiktok.com/@washingtonpost/video/7335982660361129262", "A SpaceX Falcon 9 rocket launched a robotic spacecraft to the moon early Thursday, setting up a landing on Feb. 22, which — if successful — would be the first soft landing on the moon for the United States since the last of the Apollo missions and the first commercial vehicle to touch down on the lunar surface."], ["https://www.tiktok.com/@washingtonpost/video/7335893429383187742", "A day of delirious celebration in Kansas City, Mo., ended in anguish and chaos after a volley of gunfire cut through a crowd at a rally after the Chiefs’ Super Bowl parade, killing at least one person and injuring another 21, including several children."], ["https://www.tiktok.com/@washingtonpost/video/7335596358797102367", "Thousands of drivers for ride-share platforms Uber and Lyft, as well as the food delivery service DoorDash went on strike Wednesday, in what organizers say was the largest nationwide protest action to date against the gig economy giants."], ["https://www.tiktok.com/@washingtonpost/video/7335260867925118254", "The Senate passed a $95 billion national security package after a months-long debate that has deeply divided congressional Republicans. The bill passed 70 to 29, after 22 Republicans joined Democrats in approving the aid."], ["https://www.tiktok.com/@washingtonpost/video/7335229666493484318", "Could gun ownership help explain the partisan divide in hearing loss? Maybe!"], ["https://www.tiktok.com/@washingtonpost/video/7335181456064449834", "Disney just invested $1.5 billion dollars into Epic Games, the creators of Fortnite."], ["https://www.tiktok.com/@washingtonpost/video/7334860999654149407", "Donald Trump said he would encourage Russia to attack U.S. allies. Trump’s remarks come as the GOP is debating whether to provide additional foreign aid to Ukraine, which is fighting a war with Russia after being invaded by Moscow in 2022. The Senate is considering legislation that would give $60 billion to Ukraine. House Republicans, however, have echoed Trump’s skepticism about doing so."], ["https://www.tiktok.com/@washingtonpost/video/7333731279155776799", "Thousands of people around the world are watching a livestream of an eagle’s nest in California."], ["https://www.tiktok.com/@washingtonpost/video/7333659872233393450", "Young Thug's lyrics are being used to build a criminal case against him"], ["https://www.tiktok.com/@washingtonpost/video/7333424300294262059", "The Justice Department has decided not to charge President Biden with cr!mes after he carelessly handled classified materials. The 345-page special counsel report described Biden as “an elderly man with a poor memory.”"], ["https://www.tiktok.com/@washingtonpost/video/7333306483901222174", "People who spend most of their work time sitting were found to be at least 16 percent more likely to die earlier than normal, for any reason, than were those who do not sit much while on the job, according to research published in the journal JAMA Network Open. For those who predominantly sit at work, however, the risk of dying from cardiovascular disease (CVD) was 34 percent higher than for non-sitters. The study, conducted in Taiwan, involved 481,688 participating workers, 20 and older (average age 39), who were tracked for about 13 years. None of the participants had a CVD diagnosis when they joined the study group."], ["https://www.tiktok.com/@washingtonpost/video/7333002315177168170", "A panel that blew off an Alaska Airlines plane midflight last month appears to have been installed at a Boeing factory without four bolts needed to keep it attached, according to a report by federal investigators."], ["https://www.tiktok.com/@washingtonpost/video/7332917006238289183", "Former U.N. ambassador Nikki Haley suffered an embarrassing defeat Tuesday in a nonbinding Republican primary in Nevada where she was the only major candidate on the ballot, while President Biden notched an easy victory on the Democratic side."], ["https://www.tiktok.com/@washingtonpost/video/7332617210315164958", "A pigeon held for eight months on suspicion of spying for China has been released after Indian authorities determined it was no avian agent of espionage, but a disoriented Taiwanese racing bird that had lost its way."], ["https://www.tiktok.com/@washingtonpost/video/7332552754159766827", "Streaming services are getting more ads, higher bills and low-quality shows. But why?"], ["https://www.tiktok.com/@washingtonpost/video/7332234849203293470", "Researchers said big-headed ants started an “ecological chain reaction” in a Kenya conservancy, impacting lions and other animals"], ["https://www.tiktok.com/@washingtonpost/video/7331133741676367150", "Microsoft has passed $3 trillion dollars in value, making it the most valuable company in the world - and more valuable than Apple. Microsoft CEO Satya Nadella is considered one of the most powerful leaders of the artificial intelligence boom."], ["https://www.tiktok.com/@washingtonpost/video/7331062207603592478", "An American chemist caused a stir in England on Wednesday with her suggestion that the humble cup of tea could be improved with salt, prompting shocked headlines from British news outlets and an intervention by the U.S. Embassy in London."], ["https://www.tiktok.com/@washingtonpost/video/7331023452704394526", "The Messenger is shutting down immediately, the news site’s founder told employees in an email Wednesday, marking the abrupt demise of one of the stranger and more expensive recent experiments in digital media."], ["https://www.tiktok.com/@washingtonpost/video/7330419705166957854", "Will Taylor Swift make it to the Super Bowl in time? Probably!"], ["https://www.tiktok.com/@washingtonpost/video/7330399045791321387", "In October 2021 Young Thug was arrested. His 88-page indictment show charges related to illegal poisson of firearms, drugs, and street-gang activity, according to court records."], ["https://www.tiktok.com/@washingtonpost/video/7330324661470776619", "Signing bonuses to recruit Supreme Court law clerks have reached as high as $500,000. Elite D.C. law firms want the clerks’ prestige and knowledge of the court. But, experts have concerns about sustainability and potential conflicts of interest with the judiciary."], ["https://www.tiktok.com/@washingtonpost/video/7330012449342557470", "Elon Musk’s company has successfully installed a brain chip into a living human. Musk said Monday that the first Neuralink product will be called Telepathy and initially used by people who have lost the ability to use their limbs. “Imagine if Stephen Hawking could communicate faster than a speed typist or auctioneer,” he wrote. “That’s the goal.”"], ["https://www.tiktok.com/@washingtonpost/video/7329677556335103262", ""], ["https://www.tiktok.com/@washingtonpost/video/7328537565357690142", "Florida wants to bar kids from social media. The state’s House of Representatives has greenlit what could be one of the nation’s strictest laws aimed at protecting children online, passing a bill that would bar anyone 16 and younger from using social media."], ["https://www.tiktok.com/@washingtonpost/video/7328485720191094062", "The video game “Palworld” has now sold more than 7 million copies in 7 days. It immediately became the most-played video game on the planet, with more than 2 million concurrent players on Steam. That’s larger than the biggest games of the past two years: “Elden Ring,” “Baldur’s Gate 3” and “Hogwarts Legacy.”"], ["https://www.tiktok.com/@washingtonpost/video/7328167002927795502", "Peter Navarro, 74, became the second senior former Trump adviser to face time behind bars for stonewalling Congress, joining Stephen K. Bannon."], ["https://www.tiktok.com/@washingtonpost/video/7327792609592642858", "The cause of the Alaska incident is still under investigation, with officials seeking to determine whether bolts designed to hold the plug in place were properly installed. That has raised fresh questions about Boeing’s quality control. The FAA has launched a separate review of the company’s manufacturing process, and Boeing has appointed a new internal adviser to carry out an internal review."], ["https://www.tiktok.com/@washingtonpost/video/7327758905742806303", "Nikki Haley pledged to stay in the 2024 primaries after Trump romped to a second victory on Tuesday night, winning New Hampshire by 11 percentage points with nearly 86 percent of the vote tallied. Trump on Tuesday night ridiculed Haley’s performance as fellow Republicans rallied behind him, boosting his formidable advantages ahead of the South Carolina primary."], ["https://www.tiktok.com/@washingtonpost/video/7327456269630033198", "The Supreme Court sided with the Biden administration on Monday and cleared the way for U.S. Border Patrol agents to remove razor wire Texas officials installed along a busy stretch of the southern border until the legality of the barriers is resolved in court."], ["https://www.tiktok.com/@washingtonpost/video/7327399831994141998", "Florida Gov. Ron DeSantis ended presidential campaign, which steadily deflated as he struggled to connect with voters and persuade Republicans to swap Donald Trump for a younger, more disciplined champion of his ideas. As he departed the contest, DeSantis endorsed Trump, who had relentlessly attacked the Florida governor with demeaning nicknames and charges that he was disloyal."], ["https://www.tiktok.com/@washingtonpost/video/7327344434847288618", "Apple’s new Vision Pro beats other VR and AR gear but still needs to find its purpose. Wearing Apple’s new headset, you might be totally immersed in a virtual world you operate simply by moving your eyes and fingers."], ["https://www.tiktok.com/@washingtonpost/video/7327055619326807342", "Why do dog wag their tails? Scientists have a theory. Humans tended to choose animals with waggly tails when they welcomed dog ancestors into their lives tens of thousands of years ago, a new study said."], ["https://www.tiktok.com/@washingtonpost/video/7325924161195347231", "Peer-reviewed research found certain species of dung beetles pair up spontaneously in male-female couples to move and bury balls of prized fecal matter more quickly. Biologist Claudia Tocco said she believes it is the first quantitative study of animals — besides humans — working together to move an object to an undecided destination."], ["https://www.tiktok.com/@washingtonpost/video/7325887447504637230", "🏋️ At 93, Richard Morgan is a four-time world champion in indoor rowing, with the aerobic engine of a healthy 30- or 40-year-old and the body-fat percentage of a whippet. He’s also the subject of a new case study, published last month in the Journal of Applied Physiology, that looked at his training, diet and physiology."], ["https://www.tiktok.com/@washingtonpost/video/7325148115839749422", "The U.S. government on Wednesday proposed to limit bank overdraft fees. The new draft rules, unveiled by the Consumer Financial Protection Bureau, could cap some of the charges as low as $3, part of a suite of potential changes meant to aid low-income Americans that are most at risk of racking up substantial debts."], ["https://www.tiktok.com/@washingtonpost/video/7324871881138392350", "Last year, more than 40 percent of the Earth’s surface was at least 1.5 degrees Celsius (2.7 degrees Fahrenheit) warmer than in the late 1800s, a Washington Post analysis of temperature data released by the nonprofit Berkeley Earth found."], ["https://www.tiktok.com/@washingtonpost/video/7324767150827261226", "Donald Trump romped to a decisive victory Monday night in the frigid Iowa caucuses, cementing his formidable grip over the Republican Party and pushing the nation closer to a historic modern rematch with President Biden."], ["https://www.tiktok.com/@washingtonpost/video/7323330080808176926", "🥶 Stunning cold is crashing southward from the Arctic into the Lower 48 states. It could break hundreds of records this weekend into early next week. The bitter cold will arrive in the wake of another blockbuster storm sweeping the nation."], ["https://www.tiktok.com/@washingtonpost/video/7322930311048858911", "Moments before ending his 2024 presidential campaign at a New Hampshire town hall, former New Jersey governor Chris Christie was caught on a hot mic saying GOP presidential candidate Nikki Haley will “get smoked” in the primary race."], ["https://www.tiktok.com/@washingtonpost/video/7322613447923895582", "Former President Trump is claiming immunity. Three judges on the U.S. Court of Appeals for the D.C. Circuit heard unprecedented arguments Tuesday morning on whether the U.S. Constitution makes former presidents immune from criminal prosecution."], ["https://www.tiktok.com/@washingtonpost/video/7322193750518664478", "An iPhone survived the 16,000-foot fall from the hole in the plane."], ["https://www.tiktok.com/@washingtonpost/video/7321854977461194014", "To the moon! 🚀🚀 But actually this time. A commercial spacecraft bound for the lunar surface lifted off from Cape Canaveral, Fla., early Monday in the first launch of a U.S. space mission designed to land softly on the moon since the last of the Apollo flights in 1972. But after it separated from the rocket, the spacecraft suffered a problem with its propulsion system, resulting in a “critical loss of propellant” that threatened a lunar landing."], ["https://www.tiktok.com/@washingtonpost/video/7320778104681598238", "A federal court on Wednesday posted more than 900 pages of documents related to multimillionaire and convicted sex offender Jeffrey Epstein, who was charged with sex trafficking minors in 2019 and killed himself while awaiting trial. The documents, which sparked a flurry of attention online, include previously redacted names of individuals associated with Epstein and his former partner, Ghislaine Maxwell, and serve as a reminder of the wide web of celebrities, politicians and academics in Epstein’s social sphere."], ["https://www.tiktok.com/@washingtonpost/video/7320758500647308574", "JN.1 is the new dominant variant in the latest uptick of U.S. covid cases. On Wednesday, Florida’s surgeon general called for a halt to using mRNA coronavirus vaccines, stating the shots could contaminate patients’ DNA — a claim that has been thoroughly debunked by public health experts, federal officials and the vaccine companies."], ["https://www.tiktok.com/@washingtonpost/video/7320353397369031966", "It’s not goodbye. It’s see V later. Thanks for everything,"], ["https://www.tiktok.com/@washingtonpost/video/7320283638506065183", "A federal appeals court ruled that Texas hospitals and doctors are not obligated to perform ab0rtions under a long-standing national emergency-care law."], ["https://www.tiktok.com/@washingtonpost/video/7320003206761729310", "States across the country are attempting to take Trump off the ballot in Republican primaries. More details below."], ["https://www.tiktok.com/@washingtonpost/video/7319644285614181662", "At least 48 people were k!lled by an earthquake in Ishikawa, Japan, on Monday. On Tuesday, at Tokyo’s Haneda Airport, a collision between a Japan Airlines passenger jet and a coast guard plane k!lled five coast guard crew members. The coast guard plane was heading to bring aid to earthquake victims."], ["https://www.tiktok.com/@washingtonpost/video/7319624086974434590", "The first version of Mickey Mouse became part of the public domain on January 1st. The public has gained the right to creatively use the breakout black-and-white Disney characters strictly as they appear in the 1928 animated short film “Steamboat Willie,” as well as that year’s silent version of the short film “Plane Crazy.”"], ["https://www.tiktok.com/@washingtonpost/video/7318184567251193119", "U.S. animal shelters will start 2024 the most overcrowded they have been in years, according to a broad survey of animal rescue facilities, a symptom of persistent economic concern as the country’s pandemic pet-adoption boom finally cools."], ["https://www.tiktok.com/@washingtonpost/video/7317769915442777375", "Rep. Lauren Boebert (R-Colo.) is switching congressional districts ahead of the 2024 election, a surprise move that means she will avoid a likely rematch against the Democrat she narrowly beat last year."], ["https://www.tiktok.com/@washingtonpost/video/7316967677988277535", "Five months later, Dave is back from paternity leave! And his home office is going to look a little different."], ["https://www.tiktok.com/@washingtonpost/video/7315207885150031135", "Passport processing times have returned to pre-pandemic standards, the State Department announced Monday, with routine services taking between six and eight weeks, and expedited services two to three weeks for an additional $60 fee. That’s about a month faster than the estimated wait times in March."], ["https://www.tiktok.com/@washingtonpost/video/7315174031962033450", "Rudy Giuliani has filed for Chapter 11 bankruptcy in New York, one day after a federal judge ruled that he must immediately pay the $148 million he owes two Georgia women he falsely accused of helping to steal the 2020 election."], ["https://www.tiktok.com/@washingtonpost/video/7314828825890655518", "For months, the president and first lady Jill Biden have told aides and friends they are frustrated by the president’s low approval rating and the polls that show him trailing former president Donald Trump, the front-runner for the Republican nomination — and in recent weeks, they have grown upset that they are not making more progress."], ["https://www.tiktok.com/@washingtonpost/video/7314071169274072351", "The Transportation Department fined Southwest Airlines $140 million for what it said were multiple violations of the law during its meltdown around last Christmas and New Year, while also ordering the airline to establish a $90 million fund to compensate passengers affected by future delays."], ["https://www.tiktok.com/@washingtonpost/video/7313268725254262047", "A significant storm is expected to charge up the Eastern Seaboard this weekend and Monday, generating strong winds, heavy rain and the potential for flooding. The track could take the system directly up Interstate 95, bringing the storm over most of the East Coast’s major cities and spelling widespread travel delays — especially Sunday into Monday."], ["https://www.tiktok.com/@washingtonpost/video/7312964246541733151", "House Republicans have continued to pursue an impeachment inquiry against President Biden, even though their year-long investigation hasn’t turned up any direct evidence that Biden profited from his son’s foreign business deals as they allege."], ["https://www.tiktok.com/@washingtonpost/video/7312491310034816299", "Tesla conducts largest-ever recall for ‘insufficient’ safety controls after exclusive Post report on Autopilot. The National Highway Traffic Safety Administration said Tesla will send out a software update to fix the problems."], ["https://www.tiktok.com/@washingtonpost/video/7312224840797146411", "Monumental Sports & Virginia's Governor Glenn Youngkin (R) announce deal to move Caps, Wizards to Virginia"], ["https://www.tiktok.com/@washingtonpost/video/7312162268370717995", "The largest U.S. pharmacy chains have given Americans’ prescription records to police and government investigators without a warrant, a congressional investigation found, raising concerns about threats to medical privacy."], ["https://www.tiktok.com/@washingtonpost/video/7309590146335132971", "Former speaker #kevinmccarthy"], ["https://www.tiktok.com/@washingtonpost/video/7309186014143106347", "Check out the Washington Post recipe section for all your holiday baking needs - yes, theres even a pound cake recipe"], ["https://www.tiktok.com/@washingtonpost/video/7308066693094313258", "“A day in the incongruous world of a Dubai climate confab”"], ["https://www.tiktok.com/@washingtonpost/video/7307797861020831019", "The House voted Friday to expel Rep. George Santos (R-N.Y.) from Congress — an action the chamber had previously taken only five times in U.S. history, and not for more than 20 years — in response to an array of alleged crimes and ethical lapses that came to light after the freshman lawmaker was found to have fabricated key parts of his biography."], ["https://www.tiktok.com/@washingtonpost/video/7307399445140852011", "Accounts inactive for two years or longer will be deleted for security reasons. Google said deletions begin on Dec. 1, but will start with the most obvious candidates: accounts that were created once and never used again. The company will send notices to any backup email addresses or phone numbers associated with the accounts ahead of time."], ["https://www.tiktok.com/@washingtonpost/video/7306593430887599402", "Rep. George Santos (R-N.Y.) is predicting he will be expelled from Congress as early as this week following the release of a scathing report from the House Ethics Committee, which found “substantial evidence” that he knowingly violated ethics guidelines, House rules and criminal laws."], ["https://www.tiktok.com/@washingtonpost/video/7305192533553073454", "#leftovers - Why we can’t stop watching terrible TikTok cooking videos - Perspective By Aaron Hutcherson ("], ["https://www.tiktok.com/@washingtonpost/video/7304287840362401070", "“Inside the Tofurky factory, where a Thanksgiving icon is made” Story by Laura Reiley and Lee Powell, opinions contributor underthedesknews"], ["https://www.tiktok.com/@washingtonpost/video/7303709643149298987", "What’s your Thanksgiving hot take? 🔥🦃"], ["https://www.tiktok.com/@washingtonpost/video/7302595168899796255", "What are your favorite Thanksgiving dishes? Because we know dry turkey isn’t it 🫢🍗"], ["https://www.tiktok.com/@washingtonpost/video/7301738858989964590", "The IRS unveiled new tax brackets and larger standard deductions for 2024, allowing most Americans to hold on to more of their income to keep up with inflation."], ["https://www.tiktok.com/@washingtonpost/video/7301055983818722606", ""], ["https://www.tiktok.com/@washingtonpost/video/7300583218431003947", "What would you do as CEO of the internet? At @mozilla’s Rise 25 celebration in Berlin, @theconversationalist caught up with visionaries who are shaping the future and working to"], ["https://www.tiktok.com/@washingtonpost/video/7299850294916156715", "“Millennials aren’t having kids. Here are the reasons why” We found some answers when looking into a different mystery: what’s going on with only children? Analysis by Andrew Van Dam"], ["https://www.tiktok.com/@washingtonpost/video/7299536260555672875", "Former U.N. ambassador Nikki Haley told entrepreneur and fellow Republican presidential candidate Vivek Ramaswamy to keep her daughter “out of your voice” during a contentious moment on the debate stage in Miami on Wednesday night."], ["https://www.tiktok.com/@washingtonpost/video/7299488803406826794", "GOP presidential candidates speak on TikTok in the third Republican debate."], ["https://www.tiktok.com/@washingtonpost/video/7299243334638341418", "Tuesday was Election Day 2023, and The Carmellas™️ break it down."], ["https://www.tiktok.com/@washingtonpost/video/7298863671227321642", "A store manager in Fort Myers, Florida put a skull out for sale in September and thought little of it — until an anthropologist walked into the store Saturday."], ["https://www.tiktok.com/@washingtonpost/video/7297379593336393002", "Reminder to set your clocks back an hour this weekend 🫡"], ["https://www.tiktok.com/@washingtonpost/video/7296627929901993259", "The Food and Drug Administration has issued warnings for 26 over-the-counter eye care products because of the potential for infection that could lead to vision loss or even blindness."], ["https://www.tiktok.com/@washingtonpost/video/7296609942994210094", "\"Third-party candidates see some of their best polls since Ross Perot\" Robert F. Kennedy Jr.’s poll numbers probably remain inflated, as he transitions from a primary challenge against President Biden to an independent candidacy. Not only do third-party candidates often poll much better than they ultimately perform, but Kennedy’s famous heritage gives him name recognition that few others enjoy."], ["https://www.tiktok.com/@washingtonpost/video/7295892960879693102", "A federal judge has reimposed a gag order on former president Donald Trump’s public statements in advance of his trial on charges of conspiring to subvert the results of the 2020 election."], ["https://www.tiktok.com/@washingtonpost/video/7294751123305549099", "s/o dance crew: michael blackmon, erica snow and allyson chiu 🕺🕺🕺"], ["https://www.tiktok.com/@washingtonpost/video/7294608809337556267", "”From mommy bloggers to TikTok stars: How creators built a $250B industry” Washington Post’s Drew Harwell & Taylor Lorenz break it down, from Mommy Bloggers to Mr. Beast. Check it out at washingtonpost.com"], ["https://www.tiktok.com/@washingtonpost/video/7294334834611326254", "#duet with\n@We are a newspaper."], ["https://www.tiktok.com/@washingtonpost/video/7294031823959641386", "Rep. Mike Johnson (R-La.) is an ally of former president Donald Trump and opposed certifying the 2020 election. He is antiabortion, voted against Ukraine aid and supports LGBTQ restrictions."], ["https://www.tiktok.com/@washingtonpost/video/7293186563737947438", "After Rep. Jim Jordan (R-Ohio) failed to become speaker of the House after three votes on the House floor last week, nine Republicans have announced their intention to seek their conference’s nomination."], ["https://www.tiktok.com/@washingtonpost/video/7292164941467897131", "House Republicans voted Friday for Rep. Jim Jordan (R-Ohio) to step aside as the GOP speaker nominee. This after a third vote on the House floor in which Jordan fell well short of a majority."], ["https://www.tiktok.com/@washingtonpost/video/7291450190429572395", "Gaza’s Health Ministry said 471 people were killed and more than 300 were injured. The attack is the single deadliest incident for civilians in Gaza in a war that has already killed more Palestinians and Israeli civilians than any previous conflict between Israel and Hamas."], ["https://www.tiktok.com/@washingtonpost/video/7291074201673321771", "Russian ships linked to military transport networks have collected cargo from North Korea and delivered it to an apparent Russian military port on multiple occasions over the past two months, according to new satellite images providing the clearest evidence yet that Pyongyang may be helping Moscow’s war effort."], ["https://www.tiktok.com/@washingtonpost/video/7289543006867164459", "The Post’s Jon Gerberg reported from Be’eri, Israel, near the Gaza border on Oct. 11 as the Israel-Hamas war entered a fifth day."], ["https://www.tiktok.com/@washingtonpost/video/7288364512019811626", "The Post’s Jon Gerberg reported from Kfar Aza, Israel, a village near the Gaza border, on Oct. 10, as the Israel-Hamas w@r entered a fourth day."], ["https://www.tiktok.com/@washingtonpost/video/7288073345965264170", "President Joe Biden has waived 26 federal laws in South Texas to allow for construction of roughly 20 miles of additional border wall, saying he had no choice but to use the Trump-era funding for the barrier to stop illegal migration from Mexico."], ["https://www.tiktok.com/@washingtonpost/video/7286576861839183147", "Bedbugs in Paris have captured government officials’ attention, especially in the run-up to the 2024 Olympics."], ["https://www.tiktok.com/@washingtonpost/video/7286204528318303530", "This video does not provide medical advice. It is intended for informational purposes only. It is not a substitute for medical advice, diagnosis or treatment. If you think you may have a medical emergency, immediately dial 911."], ["https://www.tiktok.com/@washingtonpost/video/7285896487647628590", "Rep. Kevin McCarthy (R-Calif.), has been removed as House speaker by far-right Republicans. McCarthy told fellow Republican lawmakers that he won’t seek the position again. The vote to remove him was the first such action in congressional history."], ["https://www.tiktok.com/@washingtonpost/video/7285367981612289323", "Some scientists are proposing to change the name of Anophthalmus hitleri to protect the beetle. They point out that the tiny blind bug has been driven to near extinction by neo-Nazis unlawfully collecting it because of its infamous scientific title."], ["https://www.tiktok.com/@washingtonpost/video/7284602753152847147", "What would make the internet a better place? @theconversationalist recently hit the streets ahead of"], ["https://www.tiktok.com/@washingtonpost/video/7284264844377771307", "Dianne Feinstein, centrist stalwart of the Senate, dies at 90"], ["https://www.tiktok.com/@washingtonpost/video/7284041522008329514", "‘There is life after the Senate. And it’s good.’ Amid the anxiety over Dianne Feinstein, Mitch McConnell and the aging of the U.S. Senate, we checked in with lawmakers who chose to step away a while ago."], ["https://www.tiktok.com/@washingtonpost/video/7283961905557933354", "U.S., 17 states sue Amazon alleging monopolistic practices led to higher prices. In a sweeping lawsuit, the Federal Trade Commission alleges the e-commerce giant abused its powers to raise prices for shoppers and levy high fees against businesses that sell on its platform - Story by Cat Zakrzewski, Will Oremus and Trisha Thadani Opinions Contributor:"], ["https://www.tiktok.com/@washingtonpost/video/7283130868053560622", "Negotiators for Hollywood studios and the Writers Guild of America reached a breakthrough agreement after five straight days of negotiations — a tentative deal to end a strike that has halted most TV and film scriptwriting in the country."], ["https://www.tiktok.com/@washingtonpost/video/7281780513063472430", "The possibility of a government shutdown is looming large. House Republicans are feuding over a stopgap funding bill meant to keep the government running after the fiscal year ends on Sept. 30."]]